XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Himax.WE2_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.7.21" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Himax</vendor>
  <name>WE2_DFP</name>
  <description>WE2 Device Family Pack</description>
  <url>https://github.com/HimaxWiseEyePlus/cmsis-packs/raw/main/WE2_DFP/</url>
  <releases>
    <release version="1.0.0" date="2023-09-11">
    Initial Version
    </release>
  </releases>
  <keywords>
    <keyword>Himax</keyword>
    <keyword>WE2</keyword>
    <keyword>WiseEye 2</keyword>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package vendor="ARM" name="CMSIS" version="5.9.0"/>
      <package vendor="ARM" name="CMSIS-DSP" version="1.11.0"/>
      <package vendor="ARM" name="CMSIS-NN" version="4.1.0"/>
      <package vendor="ARM" name="CMSIS-FreeRTOS" version="10.5.1"/>
    </packages>
  </requirements>
  <boards>
    <board vendor="Himax" name="WE2 Core Board" revision="Rev.V2">
      <description>Himax WE2 Core Board</description>
      <mountedDevice Dvendor="Himax:178" Dname="WE2_WLCSP65" />
      <compatibleDevice deviceIndex="0" Dvendor="Himax:178" Dname="WE2_LQFP128"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>
  <devices>
    <family Dfamily="WE2 Series" Dvendor="Himax:178">
      <!-- Device processor attributes -->
      <processor Pname="core0" Dcore="Cortex-M55" DcoreVersion="r1p1" Dfpu="DP_FPU" Dmpu="MPU" Dmve="FP_MVE" Ddsp="DSP" Dtz="TZ" Dendian="Little-endian" Dclock="400000000"/>
      <processor Pname="core1" Dcore="Cortex-M55" DcoreVersion="r1p1" Dfpu="DP_FPU" Dmpu="MPU" Dmve="FP_MVE" Ddsp="DSP" Dtz="TZ" Dendian="Little-endian" Dclock="100000000"/>
      <debugconfig default="swd" clock="3600000" swj="true" dormant="true"/>
      <!-- debug sequences -->
      <sequences>
        <!-- Local processor reset not avaialable in ARMv8-M -->
        <sequence name="ResetProcessor" disable="true"/>
        <!-- Override for Pre-Defined Sequences -->
        <sequence name="ResetSystem">
          <block>
            __var SCS_Addr   = 0xE000E000;
            __var AIRCR_Addr = SCS_Addr + 0xD0C;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            // Message(0, "write to AIRCR.SYSRESETREQ");
      
            __errorcontrol = 0x1;     // Skip errors, write to AIRCR.SYSRESETREQ may not be able to finish with OK response
            // Execute SYSRESETREQ via AIRCR
            Write32(AIRCR_Addr, 0x05FA0004);
            __errorcontrol = 0x0;     // Honor errors again
            DAP_Delay(20000);         // Delay of 20ms to let reset finish
          </block>
          <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
          <control while="(Read32(DHCSR_Addr) &amp; 0x02000000)" timeout="500000"/>
        </sequence>
      </sequences>
      <description>
WiseEye 2 AI Processor (WE2) WE2 offers DRAM-less, ones-to-tens mill-watt AI processors to perform real time analytics in the endpoint itself.
WE2 provides up to 50 GOPS with asymmetric multiprocessing architecture and DVFS power management.
The processors are designed to enable battery-powered intelligence vision, voice, and vibration applications.
      </description>
      <memory name="ITCM_NS"  access="rwn" start="0x00000000" size="0x00040000" startup="0" default="1" alias="ITCM_S"/>
      <memory name="DTCM_NS"  access="rwn" start="0x20000000" size="0x00040000" startup="0" default="1" alias="DTCM_S"/>
      <memory name="SRAM0_NS" access="rwn" start="0x24000000" size="0x00100000" startup="0" default="1" alias="SRAM0_S"/>
      <memory name="SRAM1_NS" access="rwn" start="0x24100000" size="0x00100000" startup="0" default="1" alias="SRAM1_S"/>
      <memory name="SRAM2_NS" access="rwn" start="0x26000000" size="0x00060000" startup="0" default="1" alias="SRAM2_S"/>
      <memory name="ITCM_S"   access="rws" start="0x10000000" size="0x00040000" startup="0" default="1"/>
      <memory name="DTCM_S"   access="rws" start="0x30000000" size="0x00040000" startup="0" default="1"/>
      <memory name="SRAM0_S"  access="rws" start="0x34000000" size="0x00100000" startup="0" default="1"/>
      <memory name="SRAM1_S"  access="rws" start="0x34100000" size="0x00100000" startup="0" default="1"/>
      <memory name="SRAM2_S"  access="rws" start="0x36000000" size="0x00060000" startup="0" default="1"/>
      <!-- ADIv6 DAP -->
      <debugport __dp="0">
        <swd idcode="0x4C013477"/>
      </debugport>
      <debug Pname="core0" __apid="1" svd="SVD/WE2_S_NS.svd" defaultResetSequence="ResetSystem"/> 
      <debug Pname="core1" __apid="2" svd="SVD/WE2_S_NS.svd" defaultResetSequence="ResetSystem"/>
      <accessportV2 __apid="0" __dp="0" address="0x00004000"/>
      <accessportV2 __apid="1" __dp="0" address="0x00006000"/>
      <accessportV2 __apid="2" __dp="0" address="0x00008000"/>
      <device Dname="WE2">
        <variant Dvariant="WE2_WLCSP65">
          <compile Pname="core0" Pdefine="CM55_BIG" define="IC_PACKAGE_WLCSP65" header="SDK/Device_Inc/WE2_ARMCM55.h"/>
          <compile Pname="core1" Pdefine="CM55_SMALL" define="IC_PACKAGE_WLCSP65" header="SDK/Device_Inc/WE2_ARMCM55.h"/>
        </variant>
        <variant Dvariant="WE2_LQFP128">
          <compile Pname="core0" Pdefine="CM55_BIG" define="IC_PACKAGE_LQFP128" header="SDK/Device_Inc/WE2_ARMCM55.h"/>
          <compile Pname="core1" Pdefine="CM55_SMALL" define="IC_PACKAGE_LQFP128" header="SDK/Device_Inc/WE2_ARMCM55.h"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="(ARMCC6)">
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>
    <condition id="(ARMGCC)">
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="(WE2.CMSIS)">
      <require Dvendor="Himax:178" Dfamily="WE2 Series" Dname="WE2_*"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.6.0"/>
    </condition>
    <condition id="(CMSIS.NN Lib)">
      <require Cclass="CMSIS" Cgroup="NN Lib" Cversion="4.1.0"/>
    </condition>
    <condition id="(CMSIS.DSP)">
      <require Cclass="CMSIS" Cgroup="DSP" Cversion="1.11.0"/>
    </condition>
    <condition id="(CMSIS.RTOS2.FreeRTOS)">
      <require Cclass="CMSIS" Cgroup="RTOS2" Csub="FreeRTOS" Cvariant="Cortex-M" Cversion="10.5.1"/>
    </condition>
