XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Himax.WE2_DFP.pdsc
    <condition id="(CMSIS.RTOS2.Keil RTX5)">
      <require Cclass="CMSIS" Cgroup="RTOS2" Csub="Keil RTX5" Cversion="5.5.4"/>
    </condition>
    <condition id="(WE2.CMSIS).(CMSIS.NN Lib)">
      <require condition="(WE2.CMSIS)"/>
      <require condition="(CMSIS.NN Lib)"/>
    </condition>
    <condition id="(WE2.CMSIS.core0)">
      <require condition="(WE2.CMSIS)"/>
      <require Dvendor="Himax:178" Dfamily="WE2 Series" Dname="WE2_*" Pname="core0"/>
    </condition>
    <condition id="(WE2.CMSIS.core1)">
      <require condition="(WE2.CMSIS)"/>
      <require Dname="WE2_*" Pname="core1"/>
      <require Dvendor="Himax:178" Dfamily="WE2 Series" DsubFamily="WE2 Series" Dname="WE2_*" Pname="core1"/>
    </condition>
    <condition id="(Device.Himax RTE.Non-secure)">
      <require Cclass="Device" Cgroup="Himax RTE" Cvariant="Non-secure"/>
    </condition>
    <condition id="(Device.Himax RTE.Secure)">
      <require Cclass="Device" Cgroup="Himax RTE" Cvariant="Secure"/>
    </condition>
    <condition id="(WE2.CMSIS).(Device.Himax RTE.Non-secure)">
      <require condition="(WE2.CMSIS)"/>
      <require condition="(Device.Himax RTE.Non-secure)"/>
    </condition>
    <condition id="(WE2.CMSIS).(Device.Himax RTE.Secure)">
      <require condition="(WE2.CMSIS)"/>
      <require condition="(Device.Himax RTE.Secure)"/>
    </condition>
    <condition id="(WE2.CMSIS.core0).(Device.Himax RTE.Non-secure)">
      <require condition="(WE2.CMSIS.core0)"/>
      <require condition="(Device.Himax RTE.Non-secure)"/>
    </condition>
    <condition id="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)">
      <require condition="(WE2.CMSIS.core0)"/>
      <require condition="(Device.Himax RTE.Secure)"/>
    </condition>
    <condition id="(WE2.CMSIS.core1).(Device.Himax RTE.Non-secure)">
      <require condition="(WE2.CMSIS.core1)"/>
      <require condition="(Device.Himax RTE.Non-secure)"/>
    </condition>
    <condition id="(WE2.CMSIS.core1).(Device.Himax RTE.Secure)">
      <require condition="(WE2.CMSIS.core1)"/>
      <require condition="(Device.Himax RTE.Secure)"/>
    </condition>
    <condition id="(WE2.CMSIS.core0).(ARMCC6)">
      <require condition="(WE2.CMSIS.core0)"/>
      <require condition="(ARMCC6)"/>
    </condition>
    <condition id="(WE2.CMSIS.core1).(ARMCC6)">
      <require condition="(WE2.CMSIS.core1)"/>
      <require condition="(ARMCC6)"/>
    </condition>
    <condition id="(WE2.CMSIS.core0).(ARMGCC)">
      <require condition="(WE2.CMSIS.core0)"/>
      <require condition="(ARMGCC)"/>
    </condition>
    <condition id="(WE2.CMSIS.core1).(ARMGCC)">
      <require condition="(WE2.CMSIS.core1)"/>
      <require condition="(ARMGCC)"/>
    </condition>
    <condition id="(Board Support.Himax_Board_Setup.Base.EVB)">
      <require Cclass="Board Support" Cgroup="Himax_Board_Setup" Csub="Base" Cvariant="EVB"/>
    </condition>
    <condition id="(Board Support.Himax_Board_Setup.Base.FPGA)">
      <require Cclass="Board Support" Cgroup="Himax_Board_Setup" Csub="Base" Cvariant="FPGA"/>
    </condition>
    <condition id="(WE2.CMSIS.core0).(Board Support.Himax_Board_Setup.Base.EVB)">
      <require condition="(WE2.CMSIS.core0)"/>
      <require condition="(Board Support.Himax_Board_Setup.Base.EVB)"/>
    </condition>
    <condition id="(WE2.CMSIS.core0).(Board Support.Himax_Board_Setup.Base.FPGA)">
      <require condition="(WE2.CMSIS.core0)"/>
      <require condition="(Board Support.Himax_Board_Setup.Base.FPGA)"/>
    </condition>
    <condition id="(WE2.CMSIS.core1).(Board Support.Himax_Board_Setup.Base.EVB)">
      <require condition="(WE2.CMSIS.core1)"/>
      <require condition="(Board Support.Himax_Board_Setup.Base.EVB)"/>
    </condition>
    <condition id="(WE2.CMSIS.core1).(Board Support.Himax_Board_Setup.Base.FPGA)">
      <require condition="(WE2.CMSIS.core1)"/>
      <require condition="(Board Support.Himax_Board_Setup.Base.FPGA)"/>
    </condition>
    <condition id="(HimaxPack.TFMv170.tfm_level.level_1)">
      <require Cclass="HimaxPack" Cgroup="TFMv170" Csub="tfm_level" Cvariant="level_1"/>
    </condition>
    <condition id="(HimaxPack.TFMv170.tfm_level.level_2)">
      <require Cclass="HimaxPack" Cgroup="TFMv170" Csub="tfm_level" Cvariant="level_2"/>
    </condition>
    <condition id="(HimaxPack.TFMv170.tfm_level.level_3)">
      <require Cclass="HimaxPack" Cgroup="TFMv170" Csub="tfm_level" Cvariant="level_3"/>
    </condition>
    <condition id="(HimaxPack.TFMv170 Test.s_ns_tests)">
      <require Cclass="HimaxPack" Cgroup="TFMv170 Test" Csub="s_ns_tests"/>
    </condition>
    <condition id="!(HimaxPack.TFMv170 Test.s_ns_tests)">
      <deny Cclass="HimaxPack" Cgroup="TFMv170 Test" Csub="s_ns_tests"/>
    </condition>
    <condition id="(WE2.core0)">
      <require Dvendor="Himax:178" Dfamily="WE2 Series" Dname="WE2_*" Pname="core0"/>
    </condition>
    <condition id="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <require Cclass="HimaxPack" Cgroup="TFMv170" Csub="tfm_domain" Cvariant="domain_s"/>
      <require condition="(WE2.core0)"/>
    </condition>
    <condition id="(HimaxPack.TFMv170.tfm_domain.domain_ns)">
      <require Cclass="HimaxPack" Cgroup="TFMv170" Csub="tfm_domain" Cvariant="domain_ns"/>
      <require condition="(WE2.core0)"/>
    </condition>
    <condition id="(HimaxPack.TFMv170.tfm_domain.domain_ns).(CMSIS.RTOS2.FreeRTOS)">
      <require Cclass="HimaxPack" Cgroup="TFMv170" Csub="tfm_domain" Cvariant="domain_ns"/>
      <require condition="(WE2.core0)"/>
      <require condition="(CMSIS.RTOS2.FreeRTOS)"/>
    </condition>
    <condition id="(HimaxPack.TFMv170.tfm_domain.domain_ns).(CMSIS.RTOS2.Keil RTX5)">
      <require Cclass="HimaxPack" Cgroup="TFMv170" Csub="tfm_domain" Cvariant="domain_ns"/>
      <require condition="(WE2.core0)"/>
      <require condition="(CMSIS.RTOS2.Keil RTX5)"/>
    </condition>
  </conditions>
  <components>
<!-- Device Startup Start -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="Secure" Cversion="1.0.0" condition="(WE2.CMSIS).(Device.Himax RTE.Secure)">
      <description>Himax WE2 System and Startup</description>
      <RTE_Components_h>
      </RTE_Components_h>
      <files>
        <file category="source" name="SDK/Core_Src/WE2_core.c" attr="config" version="1.0.0"/>

        <file category="linkerScript" condition="(WE2.CMSIS.core0).(ARMCC6)" name="SDK/CM55M_S/linker_script/arm/TrustZone_S.sct" attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="(WE2.CMSIS.core0).(ARMCC6)" name="SDK/CM55M_S/linker_script/arm/TrustZone_S_ONLY.sct" attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="(WE2.CMSIS.core0).(ARMGCC)" name="SDK/CM55M_S/linker_script/gcc/TrustZone_S.ld" attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="(WE2.CMSIS.core0).(ARMGCC)" name="SDK/CM55M_S/linker_script/gcc/TrustZone_S_ONLY.ld" attr="config" version="1.0.0"/>
        <file category="header" condition="(WE2.CMSIS.core0)" name="SDK/CM55M_TrustZone_FW_mem.h" attr="config" version="1.0.0"/>
        <file category="source" condition="(WE2.CMSIS.core0)" name="SDK/CM55M_S/device/startup_WE2_ARMCM55.cc" attr="config" version="1.0.0"/>
        <file category="source" condition="(WE2.CMSIS.core0)" name="SDK/CM55M_S/device/system_WE2_ARMCM55.c" attr="config" version="1.0.0"/>
        <file category="source" condition="(WE2.CMSIS.core0)" name="SDK/CM55M_S/trustzone/tz_cfg/trustzone_cfg.c" attr="config" version="1.0.0"/>

        <file category="linkerScript" condition="(WE2.CMSIS.core1).(ARMCC6)" name="SDK/CM55S_S/linker_script/arm/TrustZone_S.sct" attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="(WE2.CMSIS.core1).(ARMCC6)" name="SDK/CM55S_S/linker_script/arm/TrustZone_S_ONLY.sct" attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="(WE2.CMSIS.core1).(ARMGCC)" name="SDK/CM55S_S/linker_script/gcc/TrustZone_S.ld" attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="(WE2.CMSIS.core1).(ARMGCC)" name="SDK/CM55S_S/linker_script/gcc/TrustZone_S_ONLY.ld" attr="config" version="1.0.0"/>
        <file category="header" condition="(WE2.CMSIS.core1)" name="SDK/CM55S_TrustZone_FW_mem.h" attr="config" version="1.0.0"/>
        <file category="source" condition="(WE2.CMSIS.core1)" name="SDK/CM55S_S/device/startup_WE2_ARMCM55.cc" attr="config" version="1.0.0"/>
        <file category="source" condition="(WE2.CMSIS.core1)" name="SDK/CM55S_S/device/system_WE2_ARMCM55.c" attr="config" version="1.0.0"/>
        <file category="source" condition="(WE2.CMSIS.core1)" name="SDK/CM55S_S/trustzone/tz_cfg/trustzone_cfg.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cvariant="Non-secure" Cversion="1.0.0" condition="(WE2.CMSIS).(Device.Himax RTE.Non-secure)">
      <description>Himax WE2 System and Startup</description>
      <RTE_Components_h>
      </RTE_Components_h>
      <files>
        <file category="source" name="SDK/Core_Src/WE2_core.c" attr="config" version="1.0.0"/>

        <file category="linkerScript" condition="(WE2.CMSIS.core0).(ARMCC6)" name="SDK/CM55M_NS/linker_script/arm/TrustZone_NS.sct" attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="(WE2.CMSIS.core0).(ARMGCC)" name="SDK/CM55M_NS/linker_script/gcc/TrustZone_NS.ld" attr="config" version="1.0.0"/>
        <file category="header" condition="(WE2.CMSIS.core0)" name="SDK/CM55M_TrustZone_FW_mem.h" attr="config" version="1.0.0"/>
        <file category="source" condition="(WE2.CMSIS.core0)" name="SDK/CM55M_NS/device/startup_WE2_ARMCM55.cc" attr="config" version="1.0.0"/>
        <file category="source" condition="(WE2.CMSIS.core0)" name="SDK/CM55M_NS/device/system_WE2_ARMCM55.c" attr="config" version="1.0.0"/>

        <file category="linkerScript" condition="(WE2.CMSIS.core1).(ARMCC6)" name="SDK/CM55S_NS/linker_script/arm/TrustZone_NS.sct" attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="(WE2.CMSIS.core1).(ARMGCC)" name="SDK/CM55S_NS/linker_script/gcc/TrustZone_NS.ld" attr="config" version="1.0.0"/>
        <file category="header" condition="(WE2.CMSIS.core1)" name="SDK/CM55S_TrustZone_FW_mem.h" attr="config" version="1.0.0"/>
        <file category="source" condition="(WE2.CMSIS.core1)" name="SDK/CM55S_NS/device/startup_WE2_ARMCM55.cc" attr="config" version="1.0.0"/>
        <file category="source" condition="(WE2.CMSIS.core1)" name="SDK/CM55S_NS/device/system_WE2_ARMCM55.c" attr="config" version="1.0.0"/>
      </files>
    </component>
<!-- Device Startup End -->
<!-- Device Himax RTE Start -->
    <component Cclass="Device" Cgroup="Himax RTE" Csub="config" Cvariant="Secure" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 RTE Config</description>
      <RTE_Components_h>
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Device_Inc/"/>
        <file category="include" name="SDK/BSP_DRIVER/inc/"/>
        <file category="include" name="SDK/BSP_DRIVER/seconly_inc/"/>
        <file category="include" name="SDK/Interface/"/>
        <file category="include" name="SDK/CIS/"/>
        <file category="include" name="SDK/CIS/hm_common/"/>
        <file category="include" name="SDK/Library/common/xprintf/"/>
        <file category="include" name="SDK/Library/common/"/>
        <file category="include" name="SDK/Library/clib/"/>
        <file category="include" name="SDK/Library/pwrmgmt/"/>
        <file category="include" name="SDK/Library/pwrmgmt/seconly_inc/"/>
        <file category="include" name="SDK/Library/audio/"/>
        <file category="include" name="SDK/Library/audio_prerolling/"/>
        <file category="include" name="SDK/Library/hxmb/"/>
        <file category="include" name="SDK/Library/sensordp/inc/"/>
        <file category="include" name="SDK/Library/i2c_comm/"/>
        <file category="include" name="SDK/Library/spi_ptl/"/>
        <file category="include" name="SDK/Library/spi_eeprom/"/>
        <file category="include" name="SDK/Library/spi_psram/"/>
        <!-- <file category="include" name="SDK/Library/swvad/"/> -->
        <file category="include" name="SDK/Library/hxevent/"/>
        <file category="include" name="SDK/Library/img_proc/"/>
     
        <file category="include" condition="(WE2.CMSIS.core0).(Board Support.Himax_Board_Setup.Base.EVB)" name="SDK/CM55M_S/board/epii_evb/"/>
        <file category="include" condition="(WE2.CMSIS.core0).(Board Support.Himax_Board_Setup.Base.EVB)" name="SDK/CM55M_S/board/epii_evb/config/"/>
        <file category="include" condition="(WE2.CMSIS.core0).(Board Support.Himax_Board_Setup.Base.FPGA)" name="SDK/CM55M_S/board/epii_fpga/"/>
        <file category="include" condition="(WE2.CMSIS.core0).(Board Support.Himax_Board_Setup.Base.FPGA)" name="SDK/CM55M_S/board/epii_fpga/config/"/>
        <file category="include" condition="(WE2.CMSIS.core0)" name="SDK/CM55M_S/trustzone/tz_cfg/"/>
        <file category="include" condition="(WE2.CMSIS.core0)" name="SDK/CM55M_S/trustzone/nsc_function/nsc_inc/"/>    

        <file category="include" condition="(WE2.CMSIS.core1).(Board Support.Himax_Board_Setup.Base.EVB)" name="SDK/CM55S_S/board/epii_evb/"/>
        <file category="include" condition="(WE2.CMSIS.core1).(Board Support.Himax_Board_Setup.Base.EVB)" name="SDK/CM55S_S/board/epii_evb/config/"/>
        <file category="include" condition="(WE2.CMSIS.core1).(Board Support.Himax_Board_Setup.Base.FPGA)" name="SDK/CM55S_S/board/epii_fpga/"/>
        <file category="include" condition="(WE2.CMSIS.core1).(Board Support.Himax_Board_Setup.Base.FPGA)" name="SDK/CM55S_S/board/epii_fpga/config/"/>
        <file category="include" condition="(WE2.CMSIS.core1)" name="SDK/CM55S_S/trustzone/tz_cfg/"/>
        <file category="include" condition="(WE2.CMSIS.core1)" name="SDK/CM55S_S/trustzone/nsc_function/nsc_inc/"/>

        <file category="header" condition="(WE2.CMSIS.core0)" name="CMSIS/Config/Secure/core0/RTE_Device.h" attr="config" version="1.0.0"/>
        <file category="header" condition="(WE2.CMSIS.core1)" name="CMSIS/Config/Secure/core1/RTE_Device.h" attr="config" version="1.0.0"/>
        <file category="header" name="CMSIS/Config/Config_WE2_S.h" attr="config" version="1.0.0"/>
        <file category="header" name="CMSIS/Config/Config_WE2.h" attr="config" version="1.0.0"/>

        <file category="header" name="SDK/Device_Inc/WE2_device_addr.h" attr="config" version="1.0.0"/>
        <file category="header" name="SDK/Device_Inc/WE2_device.h" attr="config" version="1.0.0"/>
      </files>
    </component>
