XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Himax.WE2_DFP.pdsc
    <component Cclass="Device" Cgroup="Himax RTE" Csub="config" Cvariant="Non-secure" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 RTE Config</description>
      <RTE_Components_h>
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Device_Inc/"/>
        <file category="include" name="SDK/BSP_DRIVER/inc/"/>
        <!-- <file category="include" name="SDK/BSP_DRIVER/seconly_inc/"/> -->
        <file category="include" name="SDK/Interface/"/>
        <file category="include" name="SDK/CIS/"/>
        <file category="include" name="SDK/CIS/hm_common/"/>
        <file category="include" name="SDK/Library/common/xprintf/"/>
        <file category="include" name="SDK/Library/clib/"/>
        <file category="include" name="SDK/Library/pwrmgmt/"/>
        <!-- <file category="include" name="SDK/Library/pwrmgmt/seconly_inc/"/> -->
        <file category="include" name="SDK/Library/audio/"/>
        <file category="include" name="SDK/Library/audio_prerolling/"/>
        <file category="include" name="SDK/Library/hxmb/"/>
        <file category="include" name="SDK/Library/sensordp/inc/"/>
        <file category="include" name="SDK/Library/i2c_comm/"/>
        <file category="include" name="SDK/Library/spi_ptl/"/>
        <file category="include" name="SDK/Library/spi_eeprom/"/>
        <file category="include" name="SDK/Library/spi_psram/"/>
        <!-- <file category="include" name="SDK/Library/swvad/"/> -->
        <file category="include" name="SDK/Library/hxevent/"/>
        <file category="include" name="SDK/Library/img_proc/"/>

        <file category="include" condition="(WE2.CMSIS.core0).(Board Support.Himax_Board_Setup.Base.EVB)" name="SDK/CM55M_NS/board/epii_evb/"/>
        <file category="include" condition="(WE2.CMSIS.core0).(Board Support.Himax_Board_Setup.Base.EVB)" name="SDK/CM55M_NS/board/epii_evb/config/"/>
        <file category="include" condition="(WE2.CMSIS.core0).(Board Support.Himax_Board_Setup.Base.FPGA)" name="SDK/CM55M_NS/board/epii_fpga/"/>
        <file category="include" condition="(WE2.CMSIS.core0).(Board Support.Himax_Board_Setup.Base.FPGA)" name="SDK/CM55M_NS/board/epii_fpga/config/"/>        
        <file category="include" condition="(WE2.CMSIS.core0)" name="SDK/CM55M_NS/trustzone/nsc_function/nsc_inc/"/>

        <file category="include" condition="(WE2.CMSIS.core1).(Board Support.Himax_Board_Setup.Base.EVB)" name="SDK/CM55S_NS/board/epii_evb/"/>
        <file category="include" condition="(WE2.CMSIS.core1).(Board Support.Himax_Board_Setup.Base.EVB)" name="SDK/CM55S_NS/board/epii_evb/config/"/>
        <file category="include" condition="(WE2.CMSIS.core1).(Board Support.Himax_Board_Setup.Base.FPGA)" name="SDK/CM55S_NS/board/epii_fpga/"/>
        <file category="include" condition="(WE2.CMSIS.core1).(Board Support.Himax_Board_Setup.Base.FPGA)" name="SDK/CM55S_NS/board/epii_fpga/config/"/>       
        <file category="include" condition="(WE2.CMSIS.core1)" name="SDK/CM55S_NS/trustzone/nsc_function/nsc_inc/"/>

        <file category="header" condition="(WE2.CMSIS.core0)" name="CMSIS/Config/NonSecure/core0/RTE_Device.h" attr="config" version="1.0.0"/>
        <file category="header" condition="(WE2.CMSIS.core1)" name="CMSIS/Config/NonSecure/core1/RTE_Device.h" attr="config" version="1.0.0"/>
        <file category="header" name="CMSIS/Config/Config_WE2_NS.h" attr="config" version="1.0.0"/>
        <file category="header" name="CMSIS/Config/Config_WE2.h" attr="config" version="1.0.0"/>

        <file category="header" name="SDK/Device_Inc/WE2_device_addr.h" attr="config" version="1.0.0"/>
        <file category="header" name="SDK/Device_Inc/WE2_device.h" attr="config" version="1.0.0"/>
      </files>
    </component>
<!-- Device Himax RTE End -->
<!-- Device Himax Interface Start -->
    <component Cclass="Device" Cgroup="Himax Interface" Csub="driver" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 driver interface</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HIMAX_INTERFACE_DRIVER 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Interface/"/>
        <file category="source" name="SDK/Interface/driver_interface.c"/>
        <file category="header" name="SDK/Interface/driver_interface.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Himax Interface" Csub="timer" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 timer interface</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HIMAX_INTERFACE_TIMER 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Interface/"/>
        <file category="source" name="SDK/Interface/timer_interface.c"/>
        <file category="header" name="SDK/Interface/timer_interface.h"/>
      </files>
    </component>
<!-- Device Himax Interface End -->
<!-- Device Himax NSC Function Start -->
    <component Cclass="Device" Cgroup="Himax NSC Function" Csub="clk_ctrl" Cversion="1.0.0" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)">
      <description>Himax WE2 NSC clk_ctrl</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HIMAX_NSC_CLK_CTRL 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/CM55M_S/trustzone/nsc_function/nsc_inc/"/>
        <file category="source" name="SDK/CM55M_S/trustzone/nsc_function/nsc_src/clk_ctrl/veneer_clk_ctrl.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Himax NSC Function" Csub="power_ctrl" Cversion="1.0.0" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)">
      <description>Himax WE2 NSC power_ctrl</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HIMAX_NSC_POWER_CTRL 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/CM55M_S/trustzone/nsc_function/nsc_inc/"/>
        <file category="source" name="SDK/CM55M_S/trustzone/nsc_function/nsc_src/power_ctrl/veneer_power_ctrl.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Himax NSC Function" Csub="sys_ctrl" Cversion="1.0.0" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)">
      <description>Himax WE2 NSC sys_ctrl</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HIMAX_NSC_SYS_CTRL 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/CM55M_S/trustzone/nsc_function/nsc_inc/"/>
        <file category="source" name="SDK/CM55M_S/trustzone/nsc_function/nsc_src/sys_ctrl/veneer_sys_ctrl.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Himax NSC Function" Csub="timer_ctrl" Cversion="1.0.0" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)">
      <description>Himax WE2 NSC timer_ctrl</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HIMAX_NSC_TIMER_CTRL 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/CM55M_S/trustzone/nsc_function/nsc_inc/"/>
        <file category="source" name="SDK/CM55M_S/trustzone/nsc_function/nsc_src/timer_ctrl/veneer_timer_ctrl.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Himax NSC Function" Csub="eeprom_ctrl" Cversion="1.0.0" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)">
      <description>Himax WE2 NSC eeprom_ctrl</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HIMAX_NSC_EEPROM_CTRL 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/CM55M_S/trustzone/nsc_function/nsc_inc/"/>
        <file category="source" name="SDK/CM55M_S/trustzone/nsc_function/nsc_src/eeprom_ctrl/veneer_eeprom_ctrl.c" attr="config" version="1.0.0"/>
      </files>
    </component>
