XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Himax.WE2_DFP.pdsc
    <component Cclass="Device" Cgroup="Himax NSC Function" Csub="psram_ctrl" Cversion="1.0.0" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)">
      <description>Himax WE2 NSC psram_ctrl</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HIMAX_NSC_PSRAM_CTRL 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/CM55M_S/trustzone/nsc_function/nsc_inc/"/>
        <file category="source" name="SDK/CM55M_S/trustzone/nsc_function/nsc_src/psram_ctrl/veneer_psram_ctrl.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Himax NSC Function" Csub="clk_ctrl" Cversion="1.0.0" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Secure)">
      <description>Himax WE2 NSC clk_ctrl</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HIMAX_NSC_CLK_CTRL 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/CM55S_S/trustzone/nsc_function/nsc_inc/"/>
        <file category="source" name="SDK/CM55S_S/trustzone/nsc_function/nsc_src/clk_ctrl/veneer_clk_ctrl.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Himax NSC Function" Csub="power_ctrl" Cversion="1.0.0" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Secure)">
      <description>Himax WE2 NSC power_ctrl</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HIMAX_NSC_POWER_CTRL 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/CM55S_S/trustzone/nsc_function/nsc_inc/"/>
        <file category="source" name="SDK/CM55S_S/trustzone/nsc_function/nsc_src/power_ctrl/veneer_power_ctrl.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Himax NSC Function" Csub="sys_ctrl" Cversion="1.0.0" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Secure)">
      <description>Himax WE2 NSC sys_ctrl</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HIMAX_NSC_SYS_CTRL 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/CM55S_S/trustzone/nsc_function/nsc_inc/"/>
        <file category="source" name="SDK/CM55S_S/trustzone/nsc_function/nsc_src/sys_ctrl/veneer_sys_ctrl.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Himax NSC Function" Csub="timer_ctrl" Cversion="1.0.0" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Secure)">
      <description>Himax WE2 NSC timer_ctrl</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HIMAX_NSC_TIMER_CTRL 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/CM55S_S/trustzone/nsc_function/nsc_inc/"/>
        <file category="source" name="SDK/CM55S_S/trustzone/nsc_function/nsc_src/timer_ctrl/veneer_timer_ctrl.c" attr="config" version="1.0.0"/>
      </files>
    </component>
<!-- Device Himax NSC Function End -->
<!-- Device Himax CIS Start -->
    <component Cclass="Device" Cgroup="Himax CIS" Csub="HM_COMMON" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 CIS common protocol</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_CIS 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/CIS/"/>
        <file category="include" name="SDK/CIS/hm_common/"/>
        <file category="source" name="SDK/CIS/hm_common/hx_drv_CIS_common.c" attr="config" version="1.0.0"/>
      </files>
    </component>
<!-- Device Himax CIS Start -->
<!-- HimaxPack Library Start -->
    <component Cclass="HimaxPack" Cgroup="Library" Csub="common" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 library common xprintf</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_COMMON 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/common/xprintf/"/>
        <file category="source" name="SDK/Library/common/xprintf/xprintf.c"/>
        <!-- <file category="include" name="SDK/Library/common/"/> -->
        <file category="source" name="SDK/Library/common/console_io.c" attr="config" version="1.0.0"/>
        <file category="header" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)" name="SDK/CM55M_S/library/common/console_io.h" attr="config" version="1.0.0"/>
        <file category="header" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Non-secure)" name="SDK/CM55M_NS/library/common/console_io.h" attr="config" version="1.0.0"/>
        <file category="header" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Secure)" name="SDK/CM55S_S/library/common/console_io.h" attr="config" version="1.0.0"/>
        <file category="header" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Non-secure)" name="SDK/CM55S_NS/library/common/console_io.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="Library" Csub="clib" Cvariant="hook" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 library clib (redirect stderr,stdout ...)</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_CLIB 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/clib/"/>
        <file category="source" name="SDK/Library/clib/retarget.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="Library" Csub="clib" Cvariant="hook and retarget" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 library clib (redirect stderr,stdout ...)</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_CLIB 1
        #define RTE_HIMAXPACK_LIB_CLIB_RETARGET_IO 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/clib/"/>
        <file category="source" name="SDK/Library/clib/retarget.c" attr="config" version="1.0.0"/>
        <file category="source" condition="(ARMCC6)" name="SDK/Library/clib/arm/retarget_io.c" attr="config" version="1.0.0"/>
        <file category="source" condition="(ARMGCC)" name="SDK/Library/clib/gnu/retarget_io.c" attr="config" version="1.0.0"/>
      </files>
    </component>
