XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Himax.WE2_DFP.pdsc
    <component Cclass="HimaxPack" Cgroup="Library" Csub="pwrmgmt" Cversion="1.0.0" condition="(WE2.CMSIS).(Device.Himax RTE.Secure)">
      <description>Himax WE2 library power management</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_PWRMGMT 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/pwrmgmt/"/>
        <file category="include" name="SDK/Library/pwrmgmt/seconly_inc/"/>
        <file category="library" condition="(ARMCC6)" name="Libs/ARMCC6/libpwrmgmt.a"/>
        <file category="library" condition="(ARMGCC)" name="Libs/ARMGCC/libpwrmgmt.a"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="Library" Csub="audio" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 library audio</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_AUDIO 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/audio/"/>
        <file category="library" condition="(ARMCC6)" name="Libs/ARMCC6/libaudio.a"/>
        <file category="library" condition="(ARMGCC)" name="Libs/ARMGCC/libaudio.a"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="Library" Csub="audio_prerolling" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 library audio prerolling</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_AUDIO_PREROLLING 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/audio_prerolling/"/>
        <file category="library" condition="(ARMCC6)" name="Libs/ARMCC6/liblibaudioprerolling.a"/>
        <file category="library" condition="(ARMGCC)" name="Libs/ARMGCC/liblibaudioprerolling.a"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="Library" Csub="hxmb" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 library mailbox</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_HXMB 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/hxmb/"/>
        <!--
        <file category="source" name="SDK/Library/hxmb/hxmb.c"/>
        -->
        <file category="library" condition="(ARMCC6)" name="Libs/ARMCC6/libhxmb.a"/>
        <file category="library" condition="(ARMGCC)" name="Libs/ARMGCC/libhxmb.a"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="Library" Csub="sensordp" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 library sensor data path</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_SENSORDP 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/sensordp/inc/"/>
        <file category="library" condition="(ARMCC6)" name="Libs/ARMCC6/libsensordp.a"/>
        <file category="library" condition="(ARMGCC)" name="Libs/ARMGCC/libsensordp.a"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="Library" Csub="i2c_comm" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 library i2c communication protocol</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_I2C_COMM 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/i2c_comm/"/>
        <file category="library" condition="(ARMCC6)" name="Libs/ARMCC6/lib_i2c_comm.a"/>
        <file category="library" condition="(ARMGCC)" name="Libs/ARMGCC/lib_i2c_comm.a"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="Library" Csub="spi_ptl" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 library spi protocol</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_SPI_PTL 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/spi_ptl/"/>
        <file category="library" condition="(ARMCC6)" name="Libs/ARMCC6/lib_spi_ptl.a"/>
        <file category="library" condition="(ARMGCC)" name="Libs/ARMGCC/lib_spi_ptl.a"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="Library" Csub="spi_eeprom" Cversion="1.0.0" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)">
      <description>Himax WE2 library spi eeprom/nor flash</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_SPI_EEPROM 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/spi_eeprom/"/>	
        <file category="include" name="SDK/Library/spi_eeprom/eeprom_param/"/>	
        <file category="library" condition="(ARMCC6)" name="Libs/ARMCC6/lib_spi_eeprom.a"/>
        <file category="library" condition="(ARMGCC)" name="Libs/ARMGCC/lib_spi_eeprom.a"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="Library" Csub="spi_psram" Cversion="1.0.0" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)">
      <description>Himax WE2 library spi psram</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_SPI_PSRAM 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/spi_psram/"/>
        <file category="library" condition="(ARMCC6)" name="Libs/ARMCC6/lib_spi_psram.a"/>
        <file category="library" condition="(ARMGCC)" name="Libs/ARMGCC/lib_spi_psram.a"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="Library" Csub="hxevent" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 library hx event handler</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_EVENT 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/hxevent/"/>
        <file category="header" name="SDK/Library/hxevent/hxevent_debug.h" attr="config" version="1.0.0"/>
        <file category="library" condition="(ARMCC6)" name="Libs/ARMCC6/libhxevent.a"/>
        <file category="library" condition="(ARMGCC)" name="Libs/ARMGCC/libhxevent.a"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="Library" Csub="img_proc" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 library image processing</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_IMG_PROC 1
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/img_proc/"/>
        <file category="library" condition="(ARMCC6)" name="Libs/ARMCC6/lib_img_proc.a"/>
        <file category="library" condition="(ARMGCC)" name="Libs/ARMGCC/lib_img_proc.a"/>
      </files>
    </component>
