XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Himax.WE2_DFP.pdsc
    <component Cclass="HimaxPack" Cgroup="Library" Csub="inference" Cvariant="U55 CMSIS-NN" Cversion="1.0.0" condition="(WE2.CMSIS).(CMSIS.NN Lib)">
      <description>Himax WE2 library tensorflow lite micro (TFLM) using Ethos-U55 NPU with CMSIS-NN</description>
      <RTE_Components_h>
        #define RTE_HIMAXPACK_LIB_INFERENCE 2
      </RTE_Components_h>
      <files>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/schema/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/c/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/kernels/internal/reference/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/kernels/internal/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/kernels/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/core/api/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/third_party/flatbuffers/include/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/third_party/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/third_party/ethos_u_core_driver/include/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/third_party/ethos_u_core_driver/src/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/third_party/gemmlowp/"/>
        <file category="include" name="SDK/Library/inference/tflmtag2209_u55tag2205/third_party/ruy/"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/third_party/ethos_u_core_driver/src/ethosu_pmu.c"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/third_party/ethos_u_core_driver/src/ethosu_driver.c"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/third_party/ethos_u_core_driver/src/ethosu_device_u55_u65.c"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/c/common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/schema/schema_utils.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/kernels/internal/reference/portable_tensor_utils.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/kernels/internal/quantization_util.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/kernels/kernel_util.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/core/api/op_resolver.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/core/api/error_reporter.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/core/api/tensor_utils.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/core/api/flatbuffer_conversions.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/all_ops_resolver.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/debug_log.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/fake_micro_context.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/flatbuffer_utils.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/memory_helpers.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/micro_allocation_info.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/micro_allocator.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/micro_context.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/micro_error_reporter.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/micro_graph.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/micro_interpreter.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/micro_log.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/micro_profiler.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/micro_resource_variable.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/micro_string.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/micro_time.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/micro_utils.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/mock_micro_graph.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/recording_micro_allocator.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/test_helpers.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/test_helper_custom_ops.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/arena_allocator/non_persistent_arena_buffer_allocator.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/arena_allocator/persistent_arena_buffer_allocator.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/arena_allocator/recording_single_arena_buffer_allocator.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/arena_allocator/single_arena_buffer_allocator.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/cortex_m_corstone_300/micro_time.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/memory_planner/greedy_memory_planner.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/memory_planner/linear_memory_planner.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/memory_planner/non_persistent_buffer_planner_shim.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/activations.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/activations_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/add_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/add_n.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/arg_min_max.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/assign_variable.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/batch_to_space_nd.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/broadcast_args.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/broadcast_to.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/call_once.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/cast.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/ceil.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/circular_buffer.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/circular_buffer_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/comparisons.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/concatenation.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/conv_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/cumsum.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/depth_to_space.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/depthwise_conv_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/dequantize.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/dequantize_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/detection_postprocess.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/div.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/elementwise.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/elu.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/exp.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/expand_dims.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/fill.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/floor.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/floor_div.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/floor_mod.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/fully_connected_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/gather.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/gather_nd.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/hard_swish.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/hard_swish_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/if.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/kernel_runner.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/kernel_util.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/l2_pool_2d.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/l2norm.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/leaky_relu.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/leaky_relu_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/log_softmax.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/logical.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/logical_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/logistic.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/logistic_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/lstm_eval.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/maximum_minimum.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/micro_tensor_utils.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/mirror_pad.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/mul_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/neg.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/pack.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/pad.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/pooling_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/prelu.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/prelu_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/quantize.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/quantize_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/read_variable.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/reduce.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/reduce_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/reshape.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/resize_bilinear.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/resize_nearest_neighbor.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/round.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/select.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/shape.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/slice.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/softmax_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/space_to_batch_nd.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/space_to_depth.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/split.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/split_v.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/squared_difference.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/squeeze.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/strided_slice.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/sub.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/sub_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/svdf_common.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/tanh.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/transpose.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/transpose_conv.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/unidirectional_sequence_lstm.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/unpack.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/var_handle.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/while.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/zeros_like.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/ethos_u/ethosu.cc"/>

        <!-- add arm_nn_softmax_common_s8.c for CMSIS-NN: 3.1.0 <package name="CMSIS" vendor="ARM" version="5.9.0"/> -->
        <!-- <file category="source" condition="(CMSIS.NN Lib)" name="CMSIS/NN_3.1.0/Source/SoftmaxFunctions/arm_nn_softmax_common_s8.c"/> -->
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/cmsis_nn/add.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/cmsis_nn/conv.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/cmsis_nn/depthwise_conv.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/cmsis_nn/fully_connected.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/cmsis_nn/mul.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/cmsis_nn/pooling.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/cmsis_nn/softmax.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/cmsis_nn/svdf.cc"/>
      </files>
    </component>
