XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Himax.WE2_DFP.pdsc
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/add.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/conv.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/depthwise_conv.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/fully_connected.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/mul.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/pooling.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/softmax.cc"/>
        <file category="source" name="SDK/Library/inference/tflmtag2209_u55tag2205/tensorflow/lite/micro/kernels/svdf.cc"/>
      </files>
    </component>
<!-- HimaxPack Library End -->
<!-- Device Himax Libs Start -->
    <component Cclass="Device" Cgroup="Himax Libs" Csub="libdriver" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 driver static library</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HIMAX_LIB_LIBDRIVER 1
      </RTE_Components_h>
      <files>
        <file category="library" condition="(ARMCC6)" name="Libs/ARMCC6/libdriver.a"/>
        <file category="library" condition="(ARMGCC)" name="Libs/ARMGCC/libdriver.a"/>
      </files>
    </component>
<!-- Device Himax Libs End -->
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="Himax USART" Capiversion="1.0.0" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>USART Driver for Himax WE2</description>
      <RTE_Components_h>
        #define RTE_CMSIS_Drivers_USART
      </RTE_Components_h>
      <files>
        <file category="source" name="SDK/cmsis_drivers/USART/Driver_USART.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="Flash" Csub="Himax SPI Flash" Capiversion="1.0.0" Cversion="1.0.0" condition="(WE2.CMSIS.core0)">
      <description>SPI Flash Driver for Himax WE2</description>
      <RTE_Components_h>
        #define RTE_CMSIS_Drivers_Flash
      </RTE_Components_h>
      <files>
        <file category="source" name="SDK/cmsis_drivers/Flash/Driver_Flash.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <bundle Cbundle="WE2 Core Board" Cclass="Board Support" Cversion="1.0.0">
      <description></description>
      <doc></doc>
      <component Cgroup="Himax_Board_Setup" Csub="Base" Cvariant="EVB" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 Board Setup</description>
      <RTE_Components_h>
        #define RTE_BOARD_SUPPORT_EVB 1
      </RTE_Components_h>
        <files>
          <file category="include" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)" name="SDK/CM55M_S/board/epii_evb/"/>
          <file category="include" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)" name="SDK/CM55M_S/board/epii_evb/config/"/>
          <file category="source" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)" name="SDK/CM55M_S/board/epii_evb/board.c" attr="config" version="1.0.0"/>
          <file category="include" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Secure)" name="SDK/CM55S_S/board/epii_evb/"/>
          <file category="include" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Secure)" name="SDK/CM55S_S/board/epii_evb/config/"/>
          <file category="source" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Secure)" name="SDK/CM55S_S/board/epii_evb/board.c" attr="config" version="1.0.0"/>
          <file category="include" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Non-secure)" name="SDK/CM55M_NS/board/epii_evb/"/>
          <file category="include" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Non-secure)" name="SDK/CM55M_NS/board/epii_evb/config/"/>
          <file category="source" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Non-secure)" name="SDK/CM55M_NS/board/epii_evb/board.c" attr="config" version="1.0.0"/>
          <file category="include" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Non-secure)" name="SDK/CM55S_NS/board/epii_evb/"/>
          <file category="include" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Non-secure)" name="SDK/CM55S_NS/board/epii_evb/config/"/>
          <file category="source" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Non-secure)" name="SDK/CM55S_NS/board/epii_evb/board.c" attr="config" version="1.0.0"/>
        </files>
      </component>
      <component Cgroup="Himax_Board_Setup" Csub="Base" Cvariant="FPGA" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Himax WE2 Board Setup</description>
      <RTE_Components_h>
        #define RTE_BOARD_SUPPORT_FPGA 1
      </RTE_Components_h>
        <files>
          <file category="include" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)" name="SDK/CM55M_S/board/epii_fpga/"/>
          <file category="include" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)" name="SDK/CM55M_S/board/epii_fpga/config/"/>
          <file category="source" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Secure)" name="SDK/CM55M_S/board/epii_fpga/board.c" attr="config" version="1.0.0"/>
          <file category="include" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Secure)" name="SDK/CM55S_S/board/epii_fpga/"/>
          <file category="include" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Secure)" name="SDK/CM55S_S/board/epii_fpga/config/"/>
          <file category="source" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Secure)" name="SDK/CM55S_S/board/epii_fpga/board.c" attr="config" version="1.0.0"/>
          <file category="include" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Non-secure)" name="SDK/CM55M_NS/board/epii_fpga/"/>
          <file category="include" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Non-secure)" name="SDK/CM55M_NS/board/epii_fpga/config/"/>
          <file category="source" condition="(WE2.CMSIS.core0).(Device.Himax RTE.Non-secure)" name="SDK/CM55M_NS/board/epii_fpga/board.c" attr="config" version="1.0.0"/>
          <file category="include" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Non-secure)" name="SDK/CM55S_NS/board/epii_fpga/"/>
          <file category="include" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Non-secure)" name="SDK/CM55S_NS/board/epii_fpga/config/"/>
          <file category="source" condition="(WE2.CMSIS.core1).(Device.Himax RTE.Non-secure)" name="SDK/CM55S_NS/board/epii_fpga/board.c" attr="config" version="1.0.0"/>
        </files>
      </component>
    </bundle>
<!-- HimaxPack TFMv170 Start -->
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="tfm_domain" Cvariant="domain_s" Cversion="1.0.0" condition="(WE2.core0)">
      <description></description>
      <RTE_Components_h>
        #define RTE_TFM_DOMAIN_S 1
      </RTE_Components_h>
      <files>
        <file category="header" name="CMSIS/Config/RTE_WE2_TFM.h" attr="config" version="1.0.0"/>
        <file category="header" name="CMSIS/Config/Config_WE2_TFM.h" attr="config" version="1.0.0"/>
        <file category="include" name="TFM/tfm170/config/"/>
        <file category="include" name="TFM/tfm170/config/profile/"/>
        <file category="include" name="TFM/tfm170/generated/"/>
        <file category="include" name="TFM/tfm170/generated/interface/include/"/>
        <file category="include" name="TFM/tfm170/generated/secure_fw/partitions/crypto/"/>
        <file category="include" name="TFM/tfm170/generated/secure_fw/partitions/hx_service/"/>
        <file category="include" name="TFM/tfm170/generated/secure_fw/partitions/initial_attestation/"/>
        <file category="include" name="TFM/tfm170/generated/secure_fw/partitions/internal_trusted_storage/"/>
        <file category="include" name="TFM/tfm170/generated/secure_fw/partitions/platform/"/>
        <file category="include" name="TFM/tfm170/generated/secure_fw/partitions/protected_storage/"/>
        <file category="include" name="TFM/tfm170/generated/secure_fw/spm/include/"/>
        <file category="include" name="TFM/tfm170/interface/include/"/>
        <file category="include" name="TFM/tfm170/interface/include/crypto_keys/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/api/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/driver/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/common/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/ecc_domains/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/common/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_edw/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_mont/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_wrst/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/poly/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/rsa/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/srp/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rnd_dma/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rnd_dma/local/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rsa/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc3x_lib/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc3x_productionlib/cmpu/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc3x_productionlib/common/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc3x_productionlib/dmpu/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc_mng/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/hal/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/shared/hw/include/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/shared/include/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/shared/include/cc_mng/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/shared/include/cc_util/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/shared/include/crypto_api/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/shared/include/crypto_api/cc3x/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/shared/include/mbedtls/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/shared/include/pal/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/shared/include/pal/no_os/"/>
        <file category="include" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/shared/include/proj/cc3x/"/>
        <file category="include" name="TFM/tfm170/lib/ext/mbedcrypto-src/"/>
        <file category="include" name="TFM/tfm170/lib/ext/mbedcrypto-src/include/"/>
        <file category="include" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/"/>
        <file category="include" name="TFM/tfm170/lib/ext/mbedcrypto/mbedcrypto_config/"/>
        <file category="include" name="TFM/tfm170/lib/ext/qcbor/"/>
        <file category="include" name="TFM/tfm170/lib/ext/qcbor-src/inc/"/>
        <file category="include" name="TFM/tfm170/lib/ext/qcbor-src/inc/qcbor/"/>
        <file category="include" name="TFM/tfm170/lib/ext/t_cose/inc/"/>
        <file category="include" name="TFM/tfm170/lib/ext/t_cose/src/"/>
        <file category="include" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/common/"/>
        <file category="include" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/common/service/"/>
        <file category="include" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/common/suites/"/>
        <file category="include" name="TFM/tfm170/lib/fih/inc/"/>
        <file category="include" name="TFM/tfm170/platform/ext/"/>
        <file category="include" name="TFM/tfm170/platform/ext/accelerator/cc312/"/>
        <file category="include" name="TFM/tfm170/platform/ext/accelerator/interface/"/>
        <file category="include" name="TFM/tfm170/platform/ext/common/"/>
        <file category="include" name="TFM/tfm170/platform/ext/common/template/"/>
        <file category="include" name="TFM/tfm170/platform/ext/driver/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/cc312/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/cmsis_drivers/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/cmsis_drivers/config/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/device/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/device/config/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/device/include/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/native_drivers/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/partition/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/services/src/"/>
        <file category="include" name="TFM/tfm170/platform/include/"/>
        <file category="include" name="TFM/tfm170/secure_fw/include/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/crypto/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/crypto/psa_driver_api/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/firmware_update/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/hx_service/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/initial_attestation/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/internal_trusted_storage/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/lib/runtime/include/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/platform/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/protected_storage/"/>
        <file category="include" name="TFM/tfm170/secure_fw/spm/"/>
        <file category="include" name="TFM/tfm170/secure_fw/spm/cmsis_psa/"/>
        <file category="include" name="TFM/tfm170/secure_fw/spm/cmsis_psa/arch/"/>
        <file category="include" name="TFM/tfm170/secure_fw/spm/include/"/>
        <file category="include" name="TFM/tfm170/secure_fw/spm/include/boot/"/>
        <file category="include" name="TFM/tfm170/secure_fw/spm/include/interface/"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="tfm_domain" Cvariant="domain_ns" Cversion="1.0.0" condition="(WE2.core0)">
      <description></description>
      <RTE_Components_h>
        #define RTE_TFM_DOMAIN_NS 1
      </RTE_Components_h>
      <files>
        <file category="header" name="CMSIS/Config/RTE_WE2_TFM.h" attr="config" version="1.0.0"/>
        <file category="header" name="CMSIS/Config/Config_WE2_TFM.h" attr="config" version="1.0.0"/>
        <file category="include" name="TFM/tfm170/config/"/>
        <file category="include" name="TFM/tfm170/config/profile/"/>
        <file category="include" name="TFM/tfm170/generated/interface/include/"/>
        <file category="include" name="TFM/tfm170/interface/include/"/>
        <file category="include" name="TFM/tfm170/lib/ext/qcbor-src/inc/"/>
        <file category="include" name="TFM/tfm170/lib/ext/qcbor-src/inc/qcbor/"/>
        <file category="include" name="TFM/tfm170/lib/ext/t_cose/inc/"/>
        <file category="include" name="TFM/tfm170/lib/ext/t_cose/src/"/>
        <file category="include" name="TFM/tfm170/lib/ext/mbedcrypto/mbedcrypto_config/"/>
        <file category="include" name="TFM/tfm170/lib/ext/tfm_test_repo-src/app/"/>
        <file category="include" name="TFM/tfm170/lib/ext/tfm_test_repo-src/log/"/>
        <file category="include" name="TFM/tfm170/lib/ext/tfm_test_repo-src/ns_interface/"/>
        <file category="include" name="TFM/tfm170/lib/ext/tfm_test_repo-src/ns_interface/ns_client_ext/"/>
        <file category="include" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/common/"/>
        <file category="include" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/common/service/"/>
        <file category="include" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/common/suites/"/>
        <file category="include" name="TFM/tfm170/lib/fih/inc/"/>
        <file category="include" name="TFM/tfm170/platform/ext/"/>
        <file category="include" name="TFM/tfm170/platform/ext/common/"/>
        <file category="include" name="TFM/tfm170/platform/ext/common/template/"/>
        <file category="include" name="TFM/tfm170/platform/ext/driver/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/cmsis_drivers/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/cmsis_drivers/config/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/device/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/device/config/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/device/include/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/native_drivers/"/>
        <file category="include" name="TFM/tfm170/platform/ext/target/arm/an552_hx/partition/"/>
        <file category="include" name="TFM/tfm170/platform/include/"/>
        <file category="include" name="TFM/tfm170/secure_fw/include/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/crypto/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/firmware_update/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/initial_attestation/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/internal_trusted_storage/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/lib/runtime/include/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/platform/"/>
        <file category="include" name="TFM/tfm170/secure_fw/partitions/protected_storage/"/>
        <file category="include" name="TFM/tfm170/secure_fw/spm/"/>
        <file category="include" name="TFM/tfm170/secure_fw/spm/cmsis_psa/"/>
        <file category="include" name="TFM/tfm170/secure_fw/spm/cmsis_psa/arch/"/>
        <file category="include" name="TFM/tfm170/secure_fw/spm/include/"/>
        <file category="include" name="TFM/tfm170/secure_fw/spm/include/boot/"/>
        <file category="include" name="TFM/tfm170/secure_fw/spm/include/interface/"/>
      </files>
    </component>
