XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Himax.WE2_DFP.pdsc
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="tfm_level" Cvariant="level_1" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>Secure Partition Manager Isolation level 3</description>
      <RTE_Components_h>
        #define RTE_TFM_LVL 1
      </RTE_Components_h>
      <files>
        <file category="include" name="TFM/tfm170/"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="tfm_level" Cvariant="level_2" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>Secure Partition Manager Isolation level 3</description>
      <RTE_Components_h>
        #define RTE_TFM_LVL 2
      </RTE_Components_h>
      <files>
        <file category="include" name="TFM/tfm170/"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="tfm_level" Cvariant="level_3" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>Secure Partition Manager Isolation level 3</description>
      <RTE_Components_h>
        #define RTE_TFM_LVL 3
      </RTE_Components_h>
      <files>
        <file category="include" name="TFM/tfm170/"/>
      </files>
    </component>
    
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="tfm_s" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>TF-M Secure Domain</description>
      <RTE_Components_h>
        #define RTE_TFM_S 1
      </RTE_Components_h>
      <files>
        <file category="header" name="TFM/tfm170/config/profile/config_profile_large.h" attr="config" version="1.0.0"/>
        <file category="header" name="TFM/tfm170/lib/ext/mbedcrypto/mbedcrypto_config/tfm_mbedcrypto_config_profile_large.h" attr="config" version="1.0.0"/>
        <file category="header" name="TFM/tfm170/lib/ext/mbedcrypto/mbedcrypto_config/crypto_config_profile_large.h" attr="config" version="1.0.0"/>

        <file category="header" name="TFM/tfm170/platform/ext/target/arm/an552_hx/partition/region_defs.h" attr="config" version="1.0.0"/>
        <file category="header" name="TFM/tfm170/platform/ext/target/arm/an552_hx/partition/flash_layout.h" attr="config" version="1.0.0"/>
        <file category="header" name="TFM/tfm170/platform/ext/target/arm/an552_hx/partition/platform_base_address.h" attr="config" version="1.0.0"/>
        <file category="header" name="TFM/tfm170/platform/ext/common/tfm_s_linker_alignments.h" attr="config" version="1.0.0"/>

        <file category="header" name="TFM/demo_tfm170_s/main_s.h" attr="config" version="1.0.0"/>

        <file category="linkerScript" condition="(ARMCC6)" name="TFM/demo_tfm170_s/arm/tfm_common_s_170.sct" attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="(ARMCC6)" name="TFM/demo_tfm170_s/arm/tfm_isolation_l3_170.sct" attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="(ARMGCC)" name="TFM/demo_tfm170_s/gnu/tfm_common_s_170.ld" attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="(ARMGCC)" name="TFM/demo_tfm170_s/gnu/tfm_isolation_l3_170.ld" attr="config" version="1.0.0"/>
        <!-- libtfm_s -->
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/device/source/startup_an552.cc" attr="config" version="1.0.0"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/ns_agent_tz/psa_api_veneers.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/lib/runtime/tfm_sp_log_raw.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/tfm_interrupts.c"/>
        <!-- libtfm_partitions -->
        <file category="source" name="TFM/tfm170/secure_fw/partitions/idle_partition/load_info_idle_sp.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/ns_agent_tz/load_info_ns_agent_tz.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/partitions/crypto/auto_generated/load_info_tfm_crypto.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/partitions/hx_service/auto_generated/load_info_tfm_hx_service.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/partitions/initial_attestation/auto_generated/load_info_tfm_initial_attestation.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/partitions/internal_trusted_storage/auto_generated/load_info_tfm_internal_trusted_storage.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/partitions/platform/auto_generated/load_info_tfm_platform.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/partitions/protected_storage/auto_generated/load_info_tfm_protected_storage.c"/>
        <!-- libplatform_crypto_keys -->
        <file category="source" name="TFM/tfm170/platform/ext/common/template/crypto_keys.c"/>
        <!-- libtfm_fih -->
        <file category="source" name="TFM/tfm170/lib/fih/src/fih.c"/>
        <!-- libtfm_sprt -->
        <file category="source" name="TFM/tfm170/interface/src/tfm_attest_api.c"/>
        <file category="source" name="TFM/tfm170/interface/src/tfm_crypto_api.c"/>
        <file category="source" name="TFM/tfm170/interface/src/tfm_its_api.c"/>
        <file category="source" name="TFM/tfm170/interface/src/tfm_platform_api.c"/>
        <file category="source" name="TFM/tfm170/interface/src/tfm_ps_api.c"/>
        <file category="source" name="TFM/tfm170/interface/src/tfm_psa_call_pack.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/common_test_services/tfm_secure_client_2/tfm_secure_client_2_api.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/service/tfm_ps_test_service_api.c"/>

        <file category="source" condition="(HimaxPack.TFMv170.tfm_level.level_1)" name="TFM/tfm170/secure_fw/spm/cmsis_psa/psa_interface_cross.c"/>
        <file category="source" condition="(HimaxPack.TFMv170.tfm_level.level_2)" name="TFM/tfm170/secure_fw/spm/cmsis_psa/psa_interface_svc.c"/>
        <file category="source" condition="(HimaxPack.TFMv170.tfm_level.level_3)" name="TFM/tfm170/secure_fw/spm/cmsis_psa/psa_interface_svc.c"/>

        <file category="source" name="TFM/tfm170/secure_fw/partitions/lib/runtime/crt_memcmp.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/lib/runtime/crt_memmove.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/lib/runtime/crt_strnlen.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/lib/runtime/rt_main.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/lib/runtime/service_api.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/lib/runtime/sfn_common_thread.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/lib/runtime/sprt_partition_metadata_indicator.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/shared/crt_memcpy.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/shared/crt_memset.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/tfm_hal_sp_logdev_periph.c"/>

        <!-- s_ns_tests -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/generated/secure_fw/test_services/tfm_flih_test_service/auto_generated/load_info_tfm_flih_test_service.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/generated/secure_fw/test_services/tfm_ipc_client/auto_generated/load_info_tfm_ipc_client_test.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/generated/secure_fw/test_services/tfm_ipc_service/auto_generated/load_info_tfm_ipc_service_test.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/generated/secure_fw/test_services/tfm_ps_test_service/auto_generated/load_info_tfm_ps_test_service.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/generated/secure_fw/test_services/tfm_secure_client_2/auto_generated/load_info_tfm_secure_client_2.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/generated/secure_fw/test_services/tfm_secure_client_service/auto_generated/load_info_tfm_secure_client_service.c"/>

        <!-- libtfm_s_tests -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/secure_suites.c"/>
        <!-- libtfm_test_framework_common -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/framework/test_framework.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/framework/test_framework_helpers.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/framework/test_framework_integ_test_helper.c"/>
        <!-- libtfm_test_suite_attestation_s -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/attest_token_decode_asymmetric.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/attest_token_decode_common.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/attest_token_test.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/ext/qcbor_util/qcbor_util.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/secure/attest_asymmetric_s_interface_testsuite.c"/>
        <!-- libtfm_test_suite_crypto_s -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/crypto/crypto_tests_common.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/crypto/secure/crypto_sec_interface_testsuite.c"/>
        <!-- libtfm_test_suite_ipc_s -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/ipc/secure/ipc_s_interface_testsuite.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/common/suites/client_api_tests.c"/>
        <!-- libtfm_test_suite_its_s -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/its/its_tests_common.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/its/secure/psa_its_s_interface_testsuite.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/its/secure/psa_its_s_reliability_testsuite.c"/>
        <!-- libtfm_test_suite_platform_s -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/platform/platform_tests_common.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/platform/secure/platform_s_interface_testsuite.c"/>
        <!-- libtfm_test_suite_ps_s -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/secure/ps_rollback_protection_testsuite.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/secure/psa_ps_s_interface_testsuite.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/secure/psa_ps_s_reliability_testsuite.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="partition_ps" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libtfm_app_rot_partition_ps (protected storage)</description>
      <!-- libtfm_app_rot_partition_ps -->
      <RTE_Components_h>
        #define RTE_TFM_PARTITION_PS 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/protected_storage/crypto/ps_crypto_interface.c"/>
        <file category="source" condition="!(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/secure_fw/partitions/protected_storage/nv_counters/ps_nv_counters.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/secure/nv_counters/test_ps_nv_counters.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/protected_storage/ps_encrypted_object.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/protected_storage/ps_object_system.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/protected_storage/ps_object_table.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/protected_storage/ps_utils.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/protected_storage/tfm_protected_storage.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/protected_storage/tfm_ps_req_mngr.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/partitions/protected_storage/auto_generated/intermedia_tfm_protected_storage.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="partition_attestation" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libtfm_psa_rot_partition_attestation</description>
      <!-- libtfm_psa_rot_partition_attestation -->
      <RTE_Components_h>
        #define RTE_TFM_PARTITION_ATTESTATION 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/initial_attestation/attest_asymmetric_key.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/initial_attestation/attest_boot_data.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/initial_attestation/attest_core.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/initial_attestation/attest_token_encode.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/initial_attestation/tfm_attest.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/initial_attestation/tfm_attest_req_mngr.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/partitions/initial_attestation/auto_generated/intermedia_tfm_initial_attestation.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="partition_crypto" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libtfm_psa_rot_partition_crypto</description>
      <!-- libtfm_psa_rot_partition_crypto -->
      <RTE_Components_h>
        #define RTE_TFM_PARTITION_CRYPTO 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/crypto/crypto_aead.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/crypto/crypto_alloc.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/crypto/crypto_asymmetric.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/crypto/crypto_cipher.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/crypto/crypto_hash.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/crypto/crypto_init.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/crypto/crypto_key.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/crypto/crypto_key_derivation.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/crypto/crypto_key_management.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/crypto/crypto_mac.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/crypto/crypto_rng.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/crypto/psa_driver_api/tfm_builtin_key_loader.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/crypto/tfm_mbedcrypto_builtin_keys.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/partitions/crypto/auto_generated/intermedia_tfm_crypto.c"/>
      </files>
    </component>
