XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Himax.WE2_DFP.pdsc
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="partition_its" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libtfm_psa_rot_partition_its (internal trusted storage)</description>
      <!-- libtfm_psa_rot_partition_its -->
      <RTE_Components_h>
        #define RTE_TFM_PARTITION_ITS 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/internal_trusted_storage/flash/its_flash.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/internal_trusted_storage/flash/its_flash_nand.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/internal_trusted_storage/flash/its_flash_nor.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/internal_trusted_storage/flash/its_flash_ram.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/internal_trusted_storage/flash_fs/its_flash_fs.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/internal_trusted_storage/flash_fs/its_flash_fs_dblock.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/internal_trusted_storage/flash_fs/its_flash_fs_mblock.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/internal_trusted_storage/its_utils.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/internal_trusted_storage/tfm_internal_trusted_storage.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/internal_trusted_storage/tfm_its_req_mngr.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/partitions/crypto/auto_generated/intermedia_tfm_crypto.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/partitions/internal_trusted_storage/auto_generated/intermedia_tfm_internal_trusted_storage.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="partition_platform" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libtfm_psa_rot_partition_platform</description>
      <!-- libtfm_psa_rot_partition_platform -->
      <RTE_Components_h>
        #define RTE_TFM_PARTITION_PLATFORM 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/platform/platform_sp.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/partitions/platform/auto_generated/intermedia_tfm_platform.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="partition_hx" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libtfm_psa_rot_partition_hx</description>
      <!-- libtfm_psa_rot_partition_hx -->
      <RTE_Components_h>
        #define RTE_TFM_PARTITION_HX 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/hx_service/tfm_hx_service.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/partitions/hx_service/auto_generated/intermedia_tfm_hx_service.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="spm" Cversion="1.0.0" Cvariant="IPC" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libtfm_spm (Secure Partition Manager)</description>
      <!-- libtfm_spm -->
      <RTE_Components_h>
        #define RTE_TFM_SPM 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/platform/ext/common/tfm_hal_nvic.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/target_cfg.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/tfm_hal_isolation.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/tfm_hal_platform.c"/>
        <!-- <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/tfm_interrupts.c"/> -->
        <file category="source" name="TFM/tfm170/secure_fw/partitions/idle_partition/idle_partition.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/ns_agent_tz/ns_agent_tz.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/partitions/ns_agent_tz/ns_agent_tz_init.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/cmsis_psa/arch/tfm_arch.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/cmsis_psa/arch/tfm_arch_v8m_main.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/cmsis_psa/main_spm.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/cmsis_psa/spm_ipc.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/cmsis_psa/static_loader.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/cmsis_psa/tfm_core_svcalls_ipc.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/cmsis_psa/tfm_pools.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/cmsis_psa/thread.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/ffm/backend_ipc.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/ffm/interrupt.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/ffm/psa_api.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/ffm/spm_log.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/ffm/tfm_boot_data.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/ffm/utilities.c"/>
        <file category="source" name="TFM/tfm170/secure_fw/spm/ns_client_ext/tfm_spm_ns_ctx.c"/>
        <file category="source" condition="(HimaxPack.TFMv170.tfm_level.level_1)" name="TFM/tfm170/secure_fw/spm/cmsis_psa/spm_cross_call.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="platform_s" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libplatform_s</description>
      <!-- libplatform_s -->
      <RTE_Components_h>
        #define RTE_TFM_PLATFORM_S 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/platform/ext/common/exception_info.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/faults.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/provisioning.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/template/attest_hal.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/template/crypto_nv_seed.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/template/flash_otp_nv_counters_backend.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/template/nv_counters.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/template/otp_flash.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/template/tfm_rotpk.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/tfm_hal_its.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/tfm_hal_memory_symbols.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/tfm_hal_ps.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/tfm_hal_reset_halt.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/tfm_hal_spm_logdev_peripheral.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/uart_stdout.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/cmsis_drivers/Driver_Flash.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/cmsis_drivers/Driver_USART.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/device/source/device_definition.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/device/source/system_core_init.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/native_drivers/emulated_flash_drv.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/native_drivers/mpu_armv8m_drv.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/services/src/tfm_platform_system.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/tfm_peripherals_def.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/platform/ext/common/template/tfm_initial_attest_pub_key.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/platform/ext/target/arm/an552_hx/plat_test.c"/>
      </files>
    </component>
