XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Himax.WE2_DFP.pdsc
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="cryptocell_cc312" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libcrypto_service_crypto_hw (cc312)</description>
      <!-- libcrypto_service_crypto_hw -->
      <RTE_Components_h>
        #define RTE_TFM_CRYTOCELL_CC312 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/platform/ext/accelerator/cc312/cc312.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/accelerator/cc312/cc312_log.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/api/mbedtls_cc_chacha.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/api/mbedtls_cc_chacha_poly.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/api/mbedtls_cc_ecies.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/api/mbedtls_cc_poly.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/api/mbedtls_cc_sha512_t.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/api/mbedtls_cc_srp.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/api/mbedtls_ccm_internal.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/driver/aes_driver.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/driver/aesccm_driver.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/driver/aesgcm_driver.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/driver/bypass_driver.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/driver/chacha_driver.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/driver/driver_common.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/driver/hash_driver.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/cc3x_sym/driver/srp_driver.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/common/cc_common_conv_endian.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/common/cc_common_math.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_edw/cc_ec_edw.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_mont/cc_ec_mont.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/cc_ecdh.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/cc_ecdsa_sign.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/cc_ecdsa_verify.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/cc_ecpki_build_priv.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/cc_ecpki_build_publ.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/cc_ecpki_domain.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/cc_ecpki_kg.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/ecc_domains/cc_ecpki_domain_secp192k1.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/ecc_domains/cc_ecpki_domain_secp192r1.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/ecc_domains/cc_ecpki_domain_secp224k1.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/ecc_domains/cc_ecpki_domain_secp224r1.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/ecc_domains/cc_ecpki_domain_secp256k1.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/ecc_domains/cc_ecpki_domain_secp256r1.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/ecc_domains/cc_ecpki_domain_secp384r1.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ec_wrst/ecc_domains/cc_ecpki_domain_secp521r1.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/ffc_domain/cc_ffc_domain.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/kdf/cc_kdf.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/common/pka.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/common/pki.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/common/pki_modular_arithmetic.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_edw/ec_edw.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_edw/ec_edw_domain_25519.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_edw/pka_ec_edw.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_mont/ec_mont.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_mont/ec_mont_domain_curve25519.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_mont/pka_ec_mont.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_wrst/ec_wrst.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_wrst/ec_wrst_dsa.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_wrst/ec_wrst_genkey.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_wrst/pka_ec_wrst.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_wrst/pka_ec_wrst_dsa_verify.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/ec_wrst/pka_ec_wrst_smul_no_scap.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/poly/poly.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/rsa/rsa_genkey.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/rsa/rsa_private.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/rsa/rsa_public.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/pki/srp/srp.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rnd_dma/cc_rnd_common.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rnd_dma/llf_rnd.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rnd_dma/llf_rnd_fetrng.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rsa/cc_rsa_build.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rsa/cc_rsa_kg.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rsa/cc_rsa_oaep.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rsa/cc_rsa_pkcs_ver15_util.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rsa/cc_rsa_prim.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rsa/cc_rsa_pss21_util.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rsa/cc_rsa_schemes.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rsa/cc_rsa_sign.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/crypto_api/rsa/cc_rsa_verify.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/aes_alt.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/cc_ecp_internal.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/ccm_alt.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/chacha20_alt.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/chachapoly_alt.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/cmac_alt.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/dhm_alt.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/ecdh_alt.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/ecdsa_alt.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/ecdsa_edwards.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/ecp_common.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/gcm_alt.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/mbedtls_common.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/mbedtls_hash_common.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/poly1305_alt.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/rsa_alt.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/sha1_alt.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/sha256_alt.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/codesafe/src/mbedtls_api/trng_api.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc3x_lib/cc_lib.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc3x_lib/cc_rng_plat.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc3x_lib/cc_util_cmac.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc3x_lib/mbedtls_cc_util_asset_prov.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc3x_productionlib/cmpu/cmpu.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc3x_productionlib/cmpu/cmpu_derivation.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc3x_productionlib/cmpu/cmpu_llf_rnd.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc3x_productionlib/common/prod_crypto_driver.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc3x_productionlib/common/prod_util.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc3x_productionlib/dmpu/dmpu.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc_mng/mbedtls_cc_mng.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/cc_mng/mbedtls_cc_mng_int.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/hal/cc3x/cc_hal.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/pal/cc_pal_trng.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/pal/no_os/cc_pal.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/pal/no_os/cc_pal_abort_plat.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/pal/no_os/cc_pal_apbc.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/pal/no_os/cc_pal_dma.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/pal/no_os/cc_pal_interrupt_ctrl.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/pal/no_os/cc_pal_mem.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/pal/no_os/cc_pal_memmap.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/pal/no_os/cc_pal_mutex.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/pal/no_os/cc_pal_pm.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/host/src/utils/mbedtls_cc_util_key_derivation.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/shared/src/proj/cc3x/cc_ecpki_info.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/shared/src/proj/cc3x/cc_hash_info.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/cryptocell-312-runtime/shared/src/proj/cc3x/cc_rsa_info.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="mbedcrypto" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libmbedcrypto (Mbed TLS Crypto library)</description>
      <!-- libmbedcrypto -->
      <RTE_Components_h>
        #define RTE_TFM_MBEDCRYPTO 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/aes.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/aesni.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/aria.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/asn1parse.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/asn1write.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/base64.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/bignum.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/camellia.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/ccm.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/chacha20.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/chachapoly.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/cipher.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/cipher_wrap.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/cmac.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/constant_time.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/ctr_drbg.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/des.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/dhm.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/ecdh.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/ecdsa.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/ecjpake.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/ecp.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/ecp_curves.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/entropy.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/entropy_poll.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/error.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/gcm.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/hkdf.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/hmac_drbg.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/lmots.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/lms.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/md.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/md5.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/memory_buffer_alloc.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/mps_reader.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/mps_trace.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/nist_kw.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/oid.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/padlock.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/pem.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/pk.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/pk_wrap.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/pkcs12.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/pkcs5.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/pkparse.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/pkwrite.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/platform.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/platform_util.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/poly1305.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/psa_crypto.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/psa_crypto_aead.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/psa_crypto_cipher.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/psa_crypto_client.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/psa_crypto_driver_wrappers.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/psa_crypto_ecp.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/psa_crypto_hash.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/psa_crypto_mac.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/psa_crypto_rsa.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/psa_crypto_se.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/psa_crypto_slot_management.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/psa_crypto_storage.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/psa_its_file.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/ripemd160.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/rsa.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/rsa_alt_helpers.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/sha1.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/sha256.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/sha512.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/ssl_debug_helpers_generated.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/threading.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/timing.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/version.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/mbedcrypto-src/library/version_features.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="t_cose" Cvariant="Asymmetric" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>libtfm_t_cose (t_cose library asymmetric)</description>
      <!-- libtfm_t_cose -->
      <RTE_Components_h>
        #define RTE_TFM_T_COSE 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/lib/ext/t_cose/crypto_adapters/t_cose_psa_crypto.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/t_cose/src/t_cose_parameters.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/t_cose/src/t_cose_sign1_sign.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/t_cose/src/t_cose_sign1_verify.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/t_cose/src/t_cose_util.c"/>
      </files>
    </component>
