XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Himax.WE2_DFP.pdsc
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="qcbor" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>libtfm_qcbor (CBOR encode/decoder)</description> 
      <!-- libtfm_qcbor -->
      <RTE_Components_h>
        #define RTE_TFM_CBOR 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/lib/ext/qcbor-src/src/UsefulBuf.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/qcbor-src/src/ieee754.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/qcbor-src/src/qcbor_decode.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/qcbor-src/src/qcbor_encode.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170 Test" Csub="s_ns_tests" Cversion="1.0.0" condition="(WE2.CMSIS)">
      <description>Regression Testing</description> 
      <RTE_Components_h>
        #define RTE_TFM_S_NS_TEST 1
      </RTE_Components_h>
      <files>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/generated/secure_fw/test_services/tfm_flih_test_service/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/generated/secure_fw/test_services/tfm_ipc_client/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/generated/secure_fw/test_services/tfm_ipc_service/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/generated/secure_fw/test_services/tfm_ps_test_service/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/generated/secure_fw/test_services/tfm_secure_client_2/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/generated/secure_fw/test_services/tfm_secure_client_service/"/>

        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/framework/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/common_test_services/tfm_secure_client_2/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/common_test_services/tfm_secure_client_service/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/ext/qcbor_util/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/crypto/secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/its/secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/platform/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/platform/secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/secure/nv_counters/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/service/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/ipc/secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/ipc/service/tfm_ipc_client/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/ipc/service/tfm_ipc_service/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/irq/service/tfm_flih_test_service/"/>
      
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/t_cose/test/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/qcbor-src/test/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/framework/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/common_test_services/tfm_secure_client_2/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/common_test_services/tfm_secure_client_service/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/ext/qcbor_util/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/non_secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/crypto/non_secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/its/non_secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/platform/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/platform/non_secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/non_secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/service/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/qcbor/non_secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/ipc/non_secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/ipc/service/tfm_ipc_client/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/ipc/service/tfm_ipc_service/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/irq/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/irq/service/tfm_flih_test_service/"/>
        <file category="include" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/t_cose/non_secure/"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170 Test" Csub="partition_flih_test" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libtfm_app_rot_partition_flih_test</description> 
      <!-- libtfm_app_rot_partition_flih_test -->
      <RTE_Components_h>
        #define RTE_TFM_PARTITION_FLIH_TEST 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/irq/service/tfm_flih_test_service/tfm_flih_test_service.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/common/service/tfm_irq_test_service.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/test_services/tfm_flih_test_service/auto_generated/intermedia_tfm_flih_test_service.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170 Test" Csub="partition_ipc_client" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libtfm_app_rot_partition_ipc_client</description> 
      <!-- libtfm_app_rot_partition_ipc_client -->
      <RTE_Components_h>
        #define RTE_TFM_PARTITION_IPC_CLIENT 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/ipc/service/tfm_ipc_client/tfm_ipc_client_test.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/test_services/tfm_ipc_client/auto_generated/intermedia_tfm_ipc_client_test.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170 Test" Csub="partition_ipc_service" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libtfm_psa_rot_partition_ipc_service</description>
      <!-- libtfm_psa_rot_partition_ipc_service -->
      <RTE_Components_h>
        #define RTE_TFM_PARTITION_IPC_SERVICE 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/common/service/client_api_test_service.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/ipc/service/tfm_ipc_service/tfm_ipc_service_test.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/test_services/tfm_ipc_service/auto_generated/intermedia_tfm_ipc_service_test.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170 Test" Csub="partition_secure_client_2" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libtfm_app_rot_partition_secure_client_2</description>
      <!-- libtfm_app_rot_partition_secure_client_2 -->
      <RTE_Components_h>
        #define RTE_TFM_PARTITION_SECURE_CLIENT_2 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/common_test_services/tfm_secure_client_2/tfm_secure_client_2.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/test_services/tfm_secure_client_2/auto_generated/intermedia_tfm_secure_client_2.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170 Test" Csub="partition_ps_test" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libtfm_psa_rot_partition_ps_test</description>
      <!-- libtfm_psa_rot_partition_ps_test -->
      <RTE_Components_h>
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/service/tfm_ps_test_service.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/test_services/tfm_ps_test_service/auto_generated/intermedia_tfm_ps_test_service.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170 Test" Csub="partition_secure_client_service" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_s)">
      <description>libtfm_psa_rot_partition_secure_client_service</description>
      <!-- libtfm_psa_rot_partition_secure_client_service -->
      <RTE_Components_h>
        #define RTE_TFM_PARTITION_SECURE_CLIENT_SERVICE 1
      </RTE_Components_h>
      <files>
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/common_test_services/tfm_secure_client_service/tfm_secure_client_service.c"/>
        <file category="source" name="TFM/tfm170/generated/secure_fw/test_services/tfm_secure_client_service/auto_generated/intermedia_tfm_secure_client_service.c"/>
      </files>
    </component>
