XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Himax.WE2_DFP.pdsc
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="os_wrapper" Cvariant="RTOS2_RTX" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns).(CMSIS.RTOS2.Keil RTX5)">
      <description></description>
      <RTE_Components_h>
        #define RTE_TFM_NS_OS_WRAPPER 1
      </RTE_Components_h>
      <files>
        <!-- libCMSIS_5_tfm_ns -->
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/ns_interface/ns_client_ext/tz_shim_layer.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/app/os_wrapper_cmsis_rtos_v2.c"/>
        <!-- <file category="library" name="TFM/tfm170/lib/ext/tfm_test_repo-src/CMSIS/RTOS2/RTX/Library/CMSIS/ARM/RTX_V8MMFN.lib"/> -->
        <!-- <file category="include" name="TFM/tfm170/lib/ext/tfm_test_repo-src/CMSIS/RTOS2/Include/"/> -->
        <!-- <file category="include" name="TFM/tfm170/lib/ext/tfm_test_repo-src/CMSIS/RTOS2/RTX/Config/"/> -->
        <!-- <file category="include" name="TFM/tfm170/lib/ext/tfm_test_repo-src/CMSIS/RTOS2/RTX/Include/"/> -->
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="os_wrapper" Cvariant="RTOS2_FREERTOS" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns).(CMSIS.RTOS2.FreeRTOS)">
      <description></description>
      <RTE_Components_h>
        #define RTE_TFM_NS_OS_WRAPPER 2
      </RTE_Components_h>
      <files>
        <!-- libCMSIS_5_tfm_ns -->
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/ns_interface/ns_client_ext/tz_shim_layer.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/app/os_wrapper_cmsis_rtos_v2.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="os_wrapper" Cvariant="BARE_METAL" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)">
      <description></description>
      <RTE_Components_h>
        #define RTE_TFM_NS_OS_WRAPPER 3
      </RTE_Components_h>
      <files>
        <!-- libCMSIS_5_tfm_ns -->
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/ns_interface/ns_client_ext/tz_shim_layer.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/app/os_wrapper_cmsis_rtos_v2.c"/>
      </files>
    </component>
    <component Cclass="HimaxPack" Cgroup="TFMv170" Csub="tfm_ns" Cversion="1.0.0" condition="(HimaxPack.TFMv170.tfm_domain.domain_ns)">
      <description>TF-M Non-secure Domain</description>
      <RTE_Components_h>
        #define RTE_TFM_NS 1
      </RTE_Components_h>
      <files>
        <file category="header" name="TFM/tfm170/platform/ext/target/arm/an552_hx/partition/region_defs.h" attr="config" version="1.0.0"/>
        <file category="header" name="TFM/tfm170/platform/ext/target/arm/an552_hx/partition/flash_layout.h" attr="config" version="1.0.0"/>
        <file category="header" name="TFM/tfm170/platform/ext/target/arm/an552_hx/partition/platform_base_address.h" attr="config" version="1.0.0"/>
        <file category="header" name="TFM/tfm170/platform/ext/common/tfm_s_linker_alignments.h" attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="(ARMCC6)" name="TFM/demo_tfm170_ns/arm/tfm_common_ns_170.sct" attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="(ARMGCC)" name="TFM/demo_tfm170_ns/gnu/tfm_common_ns_170.ld" attr="config" version="1.0.0"/>

        <file category="source" name="TFM/demo_tfm170_ns/main_ns.c" attr="config" version="1.0.0"/>
        <file category="header" name="TFM/demo_tfm170_ns/main_ns.h" attr="config" version="1.0.0"/>

        <!-- libtfm_ns -->
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/device/source/startup_an552.cc" attr="config" version="1.0.0"/>
        <!-- libtfm_api_ns -->
        <file category="source" name="TFM/tfm170/interface/src/tfm_attest_api.c"/>
        <file category="source" name="TFM/tfm170/interface/src/tfm_crypto_api.c"/>
        <file category="source" name="TFM/tfm170/interface/src/tfm_hx_service_api.c"/>
        <file category="source" name="TFM/tfm170/interface/src/tfm_its_api.c"/>
        <file category="source" name="TFM/tfm170/interface/src/tfm_platform_api.c"/>
        <file category="source" name="TFM/tfm170/interface/src/tfm_ps_api.c"/>
        <file category="source" name="TFM/tfm170/interface/src/tfm_psa_ns_api.c"/>
        <file category="source" name="TFM/tfm170/interface/src/tfm_psa_ns_connection_api.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/app/tfm_ns_interface.c"/>
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/app/test_app.c"/>
        <!-- libtfm_log -->
        <file category="source" name="TFM/tfm170/lib/ext/tfm_test_repo-src/log/tfm_log_raw.c"/>
        <!-- libplatform_ns -->
        <file category="source" name="TFM/tfm170/platform/ext/common/uart_stdout.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/cmsis_drivers/Driver_USART.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/device/source/device_definition.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/target/arm/an552_hx/device/source/system_core_init.c"/>
        <file category="source" name="TFM/tfm170/platform/ext/common/template/tfm_initial_attest_pub_key.c"/>

        <!-- s_ns_tests -->
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/t_cose/test/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/qcbor-src/test/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/framework/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/common_test_services/tfm_secure_client_2/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/common_test_services/tfm_secure_client_service/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/ext/qcbor_util/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/non_secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/crypto/non_secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/its/non_secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/platform/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/platform/non_secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/non_secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/service/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/qcbor/non_secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/ipc/non_secure/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/ipc/service/tfm_ipc_client/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/ipc/service/tfm_ipc_service/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/irq/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/irq/service/tfm_flih_test_service/"/>
        <file category="include" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/t_cose/non_secure/"/>

        <!-- libtfm_qcbor_test -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/qcbor-src/test/UsefulBuf_Tests.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/qcbor-src/test/qcbor_decode_tests.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/qcbor-src/test/qcbor_encode_tests.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/qcbor-src/test/qcbor_run_tests.c"/>
        <!-- libtfm_t_cose_test -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/t_cose/test/t_cose_run_tests.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/t_cose/test/t_cose_make_psa_test_key.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/t_cose/test/t_cose_make_test_messages.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/t_cose/test/t_cose_sign_verify_test.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/t_cose/test/t_cose_test.c"/>
        <!-- libtfm_ns_tests -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/non_secure_suites.c"/>
        <!-- libtfm_test_framework_common -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/framework/test_framework.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/framework/test_framework_helpers.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/framework/test_framework_integ_test_helper.c"/>
        <!-- libtfm_test_suite_attestation_ns -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/attest_token_decode_asymmetric.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/attest_token_decode_common.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/attest_token_test.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/ext/qcbor_util/qcbor_util.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/attestation/non_secure/attest_asymmetric_ns_interface_testsuite.c"/>
        <!-- libtfm_test_suite_crypto_ns -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/crypto/crypto_tests_common.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/crypto/non_secure/crypto_ns_interface_testsuite.c"/>
        <!-- libtfm_test_suite_ipc_ns -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/ipc/non_secure/ipc_ns_interface_testsuite.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/common/suites/client_api_tests.c"/>
        <!-- libtfm_test_suite_irq -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/irq/irq_testsuite.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/spm/common/suites/irq_test.c"/>
        <!-- libtfm_test_suite_its_ns -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/its/its_tests_common.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/its/non_secure/psa_its_ns_interface_testsuite.c"/>
        <!-- libtfm_test_suite_platform_ns -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/platform/non_secure/platform_ns_interface_testsuite.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/platform/platform_tests_common.c"/>
        <!-- libtfm_test_suite_ps_ns -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/non_secure/ns_test_helpers.c"/>
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/ps/non_secure/psa_ps_ns_interface_testsuite.c"/>
        <!-- libtfm_test_suite_qcbor_ns -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/qcbor/non_secure/qcbor_ns_testsuite.c"/>
        <!-- libtfm_test_suite_t_cose_ns -->
        <file category="source" condition="(HimaxPack.TFMv170 Test.s_ns_tests)" name="TFM/tfm170/lib/ext/tfm_test_repo-src/test/secure_fw/suites/t_cose/non_secure/t_cose_ns_testsuite.c"/>
      </files>
    </component>
