XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Himax.WE2_DFP.pdsc
<!-- HimaxPack TFMv170 End -->
  </components>
  <examples>
    <!-- ARM MDK Start -->
    <example name="[WLCSP65][MDK] hello_world_s_only" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/hello_world_s_only" version="1.0.0">
      <description>[MDK] BareMetal hello_world single core secure only</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="hello_world_s_only.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] hello_world_tz" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/hello_world_tz" version="1.0.0">
      <description>[MDK] BareMetal hello_world single core secure/non-secure</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="hello_world_tz.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] hello_world_tz_RTOS2_FreeRTOS" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/hello_world_tz_RTOS2_FreeRTOS" version="1.0.0">
      <description>[MDK] RTOS2 FreeRTOS hello_world single core secure/non-secure</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="hello_world_tz_RTOS2_FreeRTOS.uvmpw"/>
      </project>
      <attributes>
        <category>CMSIS-RTOS2</category>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] hello_world_tz_RTOS2_RTX" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/hello_world_tz_RTOS2_RTX" version="1.0.0">
      <description>[MDK] RTOS2 RTX hello_world single core secure/non-secure</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="hello_world_tz_RTOS2_RTX.uvmpw"/>
      </project>
      <attributes>
        <category>CMSIS-RTOS2</category>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] hello_world_s_only_dual_core" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/hello_world_s_only_dual_core" version="1.0.0">
      <description>[MDK] BareMetal hello_world dual core core0 and core1 secure only</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="hello_world_secure_only_dual_core.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] hello_world_tz_dual_core" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/hello_world_tz_dual_core" version="1.0.0">
      <description>[MDK] BareMetal hello_world dual core core0 and core1 secure/non-secure</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="hello_world_tz_dual_core.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] allon_sensor_tflm_s_only" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/allon_sensor_tflm_s_only" version="1.0.0">
      <description>[MDK] BareMetal allon_sensor_tflm secure only</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="allon_sensor_tflm_s_only.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="NN Lib"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] pmu_dpd_sample_s_only" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/pmu_dpd_sample_s_only" version="1.0.0">
      <description>[MDK] WE2 pmu example</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="pmu_dpd_sample_s_only.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] pmu_pd_sample_s_only" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/pmu_pd_sample_s_only" version="1.0.0">
      <description>[MDK] WE2 pmu example</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="pmu_pd_sample_s_only.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] pmu_vidpre_sample_s_only" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/pmu_vidpre_sample_s_only" version="1.0.0">
      <description>[MDK] WE2 pmu example</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="pmu_vidpre_sample_s_only.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] pmu_audpre_timer2_sample_s_only_daul_core" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/pmu_audpre_timer2_sample_s_only_daul_core" version="1.0.0">
      <description>[MDK] WE2 pmu example</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="pmu_audpre_timer2_sample_s_only_daul_core.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] pmu_audvidpre_timer2_sample_s_only_daul_core" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/pmu_audvidpre_timer2_sample_s_only_daul_core" version="1.0.0">
      <description>[MDK] WE2 pmu example</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="pmu_audvidpre_timer2_sample_s_only_daul_core.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] pmu_sim_s_only_audpre_vad_daul_core" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/pmu_sim_s_only_audpre_vad_daul_core" version="1.0.0">
      <description>[MDK] WE2 pmu example</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="pmu_sim_tz_s_only_audpre_vad_daul_core.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] demo_TFM_LV2_Test" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/demo_TFM_LV2_Test" version="1.0.0">
      <description>[MDK] demo TFM Isolation level 2 Regression Testing. NS Bare_Metal,RTOS2_FreeRTOS,RTOS2_RTX</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="demo_TFM_LV2_NS_Bare_Metal.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <keyword>TFM</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] demo_TFM_LV2" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/demo_TFM_LV2" version="1.0.0">
      <description>[MDK] demo TFM Isolation level 2 hello world. NS Bare_Metal,RTOS2_FreeRTOS,RTOS2_RTX</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="demo_TFM_LV2_NS_Bare_Metal.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <keyword>TFM</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] demo_TFM_LV3_Test" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/demo_TFM_LV3_Test" version="1.0.0">
      <description>[MDK] demo TFM Isolation level 3 Regression Testing. NS Bare_Metal,RTOS2_FreeRTOS,RTOS2_RTX</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="demo_TFM_LV3_NS_Bare_Metal.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <keyword>TFM</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
      </attributes>
    </example>
    <example name="[WLCSP65][MDK] demo_TFM_LV3" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/MDK/demo_TFM_LV3" version="1.0.0">
      <description>[MDK] demo TFM Isolation level 3 hello world. NS Bare_Metal,RTOS2_FreeRTOS,RTOS2_RTX</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="uv" load="demo_TFM_LV3_NS_Bare_Metal.uvmpw"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <keyword>TFM</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
      </attributes>
    </example>
    <!-- ARM MDK End -->
    <!-- CMSIS ARM Start -->
    <example name="[WLCSP65][CMSIS][ARM] hello_world_s_only" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/hello_world_s_only" version="1.0.0">
      <description>[vscode csolution armclang] BareMetal hello_world single core secure only</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="hello_world_s_only.csolution.yaml"/>
        <environment name="uv" load="hello_world_s_only.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] hello_world_tz" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/hello_world_tz" version="1.0.0">
      <description>[vscode csolution armclang] BareMetal hello_world single core secure/non-secure</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="hello_world_tz.csolution.yaml"/>
        <environment name="uv" load="hello_world_tz.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] hello_world_tz_RTOS2_FreeRTOS" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/hello_world_tz_RTOS2_FreeRTOS" version="1.0.0">
      <description>[vscode csolution armclang] RTOS2 FreeRTOS hello_world single core secure/non-secure</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="hello_world_tz_RTOS2_FreeRTOS.csolution.yaml"/>
        <environment name="uv" load="hello_world_tz_RTOS2_FreeRTOS.csolution.yaml"/>
      </project>
      <attributes>
        <category>CMSIS-RTOS2</category>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] hello_world_tz_RTOS2_RTX" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/hello_world_tz_RTOS2_RTX" version="1.0.0">
      <description>[vscode csolution armclang] RTOS2 RTX hello_world single core secure/non-secure</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="hello_world_tz_RTOS2_RTX.csolution.yaml"/>
        <environment name="uv" load="hello_world_tz_RTOS2_RTX.csolution.yaml"/>
      </project>
      <attributes>
        <category>CMSIS-RTOS2</category>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] hello_world_s_only_dual_core" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/hello_world_s_only_dual_core" version="1.0.0">
      <description>[vscode csolution armclang] BareMetal hello_world dual core core0 and core1 secure only</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="hello_world_secure_only_dual_core.csolution.yaml"/>
        <environment name="uv" load="hello_world_secure_only_dual_core.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] hello_world_tz_dual_core" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/hello_world_tz_dual_core" version="1.0.0">
      <description>[vscode csolution armclang] BareMetal hello_world dual core core0 and core1 secure/non-secure</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="hello_world_tz_dual_core.csolution.yaml"/>
        <environment name="uv" load="hello_world_tz_dual_core.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] allon_sensor_tflm_s_only" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/allon_sensor_tflm_s_only" version="1.0.0">
      <description>[vscode csolution armclang] BareMetal allon_sensor_tflm secure only</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="allon_sensor_tflm_s_only.csolution.yaml"/>
        <environment name="uv" load="allon_sensor_tflm_s_only.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="NN Lib"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] pmu_dpd_sample_s_only" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/pmu_dpd_sample_s_only" version="1.0.0">
      <description>[vscode csolution armclang] WE2 pmu example</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="pmu_dpd_sample_s_only.csolution.yaml"/>
        <environment name="uv" load="pmu_dpd_sample_s_only.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] pmu_pd_sample_s_only" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/pmu_pd_sample_s_only" version="1.0.0">
      <description>[vscode csolution armclang] WE2 pmu example</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="pmu_pd_sample_s_only.csolution.yaml"/>
        <environment name="uv" load="pmu_pd_sample_s_only.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] pmu_vidpre_sample_s_only" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/pmu_vidpre_sample_s_only" version="1.0.0">
      <description>[vscode csolution armclang] WE2 pmu example</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="pmu_vidpre_sample_s_only.csolution.yaml"/>
        <environment name="uv" load="pmu_vidpre_sample_s_only.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] pmu_audpre_timer2_sample_s_only_daul_core" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/pmu_audpre_timer2_sample_s_only_daul_core" version="1.0.0">
      <description>[vscode csolution armclang] WE2 pmu example</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="pmu_audpre_timer2_sample_s_only_daul_core.csolution.yaml"/>
        <environment name="uv" load="pmu_audpre_timer2_sample_s_only_daul_core.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] pmu_audvidpre_timer2_sample_s_only_daul_core" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/pmu_audvidpre_timer2_sample_s_only_daul_core" version="1.0.0">
      <description>[vscode csolution armclang] WE2 pmu example</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="pmu_audvidpre_timer2_sample_s_only_daul_core.csolution.yaml"/>
        <environment name="uv" load="pmu_audvidpre_timer2_sample_s_only_daul_core.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] pmu_sim_s_only_audpre_vad_daul_core" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/pmu_sim_s_only_audpre_vad_daul_core" version="1.0.0">
      <description>[vscode csolution armclang] WE2 pmu example</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="pmu_sim_tz_s_only_audpre_vad_daul_core.csolution.yaml"/>
        <environment name="uv" load="pmu_sim_tz_s_only_audpre_vad_daul_core.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] demo_TFM_LV2_Test" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/demo_TFM_LV2_Test" version="1.0.0">
      <description>[vscode csolution armclang] demo TFM Isolation level 2 Regression Testing. NS Bare_Metal,RTOS2_FreeRTOS,RTOS2_RTX</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="demo_TFM_LV2_NS_Bare_Metal.csolution.yaml"/>
        <environment name="uv" load="demo_TFM_LV2_NS_Bare_Metal.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <keyword>TFM</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] demo_TFM_LV2" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/demo_TFM_LV2" version="1.0.0">
      <description>[vscode csolution armclang] demo TFM Isolation level 2 hello world. NS Bare_Metal,RTOS2_FreeRTOS,RTOS2_RTX</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="demo_TFM_LV2_NS_Bare_Metal.csolution.yaml"/>
        <environment name="uv" load="demo_TFM_LV2_NS_Bare_Metal.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <keyword>TFM</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] demo_TFM_LV3_Test" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/demo_TFM_LV3_Test" version="1.0.0">
      <description>[vscode csolution armclang] demo TFM Isolation level 3 Regression Testing. NS Bare_Metal,RTOS2_FreeRTOS,RTOS2_RTX</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="demo_TFM_LV3_NS_Bare_Metal.csolution.yaml"/>
        <environment name="uv" load="demo_TFM_LV3_NS_Bare_Metal.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <keyword>TFM</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][ARM] demo_TFM_LV3" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/ARM/demo_TFM_LV3" version="1.0.0">
      <description>[vscode csolution armclang] demo TFM Isolation level 3 hello world. NS Bare_Metal,RTOS2_FreeRTOS,RTOS2_RTX</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="demo_TFM_LV3_NS_Bare_Metal.csolution.yaml"/>
        <environment name="csolution" load="demo_TFM_LV3_NS_RTOS2_FreeRTOS.csolution.yaml"/>
        <environment name="csolution" load="demo_TFM_LV3_NS_RTOS2_RTX.csolution.yaml"/>
        <environment name="uv" load="demo_TFM_LV3_NS_Bare_Metal.csolution.yaml"/>
        <environment name="uv" load="demo_TFM_LV3_NS_RTOS2_FreeRTOS.csolution.yaml"/>
        <environment name="uv" load="demo_TFM_LV3_NS_RTOS2_RTX.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <keyword>TFM</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="NN Lib"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
      </attributes>
    </example>
    <!-- CMSIS ARM End -->
    <!-- CMSIS GCC Start -->
    <example name="[WLCSP65][CMSIS][GCC] hello_world_s_only" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/GCC/hello_world_s_only" version="1.0.0">
      <description>[vscode csolution gcc] BareMetal hello_world single core secure only</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="hello_world_s_only.csolution.yaml"/>
        <environment name="uv" load="hello_world_s_only.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][GCC] hello_world_tz" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/GCC/hello_world_tz" version="1.0.0">
      <description>[vscode csolution gcc] BareMetal hello_world single core secure/non-secure</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
        <environment name="csolution" load="hello_world_tz.csolution.yaml"/>
        <environment name="uv" load="hello_world_tz.csolution.yaml"/>
      </project>
      <attributes>
        <keyword>Getting Started</keyword>
        <component Cclass="CMSIS" Cgroup="CORE"/>
      </attributes>
    </example>
    <example name="[WLCSP65][CMSIS][GCC] hello_world_tz_RTOS2_FreeRTOS" doc="Abstract.txt" folder="WE2_Ex/WLCSP65/CMSIS/GCC/hello_world_tz_RTOS2_FreeRTOS" version="1.0.0">
      <description>[vscode csolution gcc] RTOS2 FreeRTOS hello_world single core secure/non-secure</description>
      <board name="WE2 Core Board" vendor="Himax"/>
      <project>
